{
// CONFIG
	"config.Jukebox.name": "Jukebox",
	"config.Jukebox.values.Vanilla": "Vanilla",
	"config.Jukebox.values.RecordPlayer": "RecordPlayer",
	
// DIALOGUE - REGULAR
	// CHARLES
	"charles_dialogue.Introduction": "You can see me..? Aces!#$b#I'm Charles, and this is Edwin. We're the Dead Boy Detectives.",
	"charles_dialogue.cc_Begin": "Been hearing a lot of noise from beneath the office lately. You done something, mate?",
	"charles_dialogue.cc_Boulder": "Have you seen all those sparking bits in the water lately? Weird.",
	"charles_dialogue.cc_Bus": "Heard you got that old bus fixed. Nice job!$h",
	"charles_dialogue.cc_Minecart": "You fixed up the minecarts, then? Now you can get around as easy as us ghosts mirror-hopping!$2.",
	"charles_dialogue.cc_Complete": "Wow, the Community Center is looking better than ever!$h#$b#I just hope nobody is bothered by our office upstairs...",
	"charles_dialogue.movieTheater": "Did you see that there's a cinema opening in town?#$b#I can't wait to go.",
	"charles_dialogue.firstVisit_Mine": "Those old mines are spooky, aren't they? You look like the tough sort though.",
	"charles_dialogue.GreenRainFinished": "What was up with that green rain? Edwin 'n I have never seen anything like it, except for that time back in '09.",
	"charles_dialogue.MovieInvite_Invited": "You bought me a ticket to the cinema? I'd love to go!$h",
	"charles_dialogue.DumpsterDiveComment": "Mate, if you need help, Edwin and I can look into it, yeah? You don't have to go digging in the bins.$2",
	"charles_dialogue.FlowerDance_Accept_Spouse": "",
	"charles_dialogue.FlowerDance_Accept": "Oh, aces, I love dancing!",
	"charles_dialogue.FlowerDance_Decline": "Would look kind of odd, wouldn't it, dancing with a ghost?",
	"charles_dialogue.AcceptGift_(O)StardropTea": "You mean I can actually drink this? Mate, this might be the best gift anyone's ever given me.$4",
	"charles_dialogue.divorced": "What do you want? I'm busy with a case.$5",
	"charles_dialogue.eventSeen_handwrittenhello.dbda_Seance2": "Thanks again for all your help, @. It's absolutely brills that we got Niko back!$h",
	
	"charles_dialogue.Mon": "You should come see the agency sometime. We've set up right above the old Community Center.#$b#$1Nobody ever comes in there, so they can't complain it's haunted if we're too loud.",
	"charles_dialogue.Tue": "You can tell us if you’ve got any supernatural mysteries that need solving, yeah?",
	"charles_dialogue.Wed": "You live on %farm, yeah? That's brills! I never tried gardening myself, but it must be aces growing your own food.",
	"charles_dialogue.Thu": "You seem pretty handy. Maybe you could help us out on a case sometime!",
	"charles_dialogue.Fri": "Edwin and I once solved a case on %farm. That was before you came to stay, though.",
	"charles_dialogue.Sat": "Do you go fishing very often? Careful not to fall in.$7",
	"charles_dialogue.Sun": "Other people might have the day off, but our work never stops, huh?$1",
	
	"charles_dialogue.Mon2": "I gotta get back to London one of these days for potion ingredients.#$b#Edwin gets moody when we're running low.",
	"charles_dialogue.Tue2": "Edwin isn't that good with people, but you have to cut him some slack.#$b#He spent seventy years in Hell, you know?$2",
	"charles_dialogue.Wed2": "Ever been down to Tragic Mick's? He's a good bloke, and he's got some absolutely insane items.",
	"charles_dialogue.Thu2": "Hey @! How are things on the farm?",
	"charles_dialogue.Fri2": "You know, we came to Pelican Town back in '06 to deal with some banshees. Yeah... Good times...",
	"charles_dialogue.Sat2": "I bet you can't beat my high score at Junimo Kart. I've been playing arcade games longer than you've been alive!",
	"charles_dialogue.Sun2": "We should hang around more! I could wear a disguise and you can pretend I’m an old uncle visiting.$h",
	
	"charles_dialogue.Mon4": "We should hang around more! Folks usually don’t see me, so it gets lonely sometimes.#$e#Uhh… Please don’t tell Edwin I said that.",
	"charles_dialogue.Tue4": "Hey, if you ever end up taking a trip to London, let me know! I'd be happy to show you around our usual haunts.$h",
	"charles_dialogue.Wed4": "You seem pretty handy. Maybe you could help us out on a case sometime!",
	"charles_dialogue.Thu4": "Have you ever been to Ginger Island? I hear it's proper warm there, like, all the time.",
	"charles_dialogue.Fri4": "You can tell us if you’ve got any supernatural mysteries that need solving, yeah?",
	"charles_dialogue.Sat4": "The agency is open on weekends too! Ghosts don’t really have to sleep or rest... Sigh... But I wish we would take breaks sometimes.",
	"charles_dialogue.Sun4": "Will you grow any tomatoes this summer? My mum used to make the best spaghetti sauce. #$b#$2I miss it so much...",
	
	"charles_dialogue.Mon6": "You can tell us if you’ve got any supernatural mysteries that need solving, yeah?",
	"charles_dialogue.Tue6": "Hey, @! Been down to the mines lately? It can be dangerous, but I love a good thrill.#$e#They don't call me the brawn for nothing.$u",
	"charles_dialogue.Wed6": "Let me know if you ever want to take a break and play some football. I've got one back at the office, and I've got rusty without anyone to play a proper match with.",
	"charles_dialogue.Thu6": "Do you go fishing very often? Careful not to fall in.$7",
	"charles_dialogue.Fri6": "I'm enjoying our time in Pelican Town!#$b#Especially since meeting such a good friend like you.$4",
	"charles_dialogue.Sat6": "The agency is open on weekends too! Ghosts don’t really have to sleep or rest... Sigh... But I wish we would take breaks sometimes.",
	"charles_dialogue.Sun6": "Last month we helped out an old ghost who was stuck in JojaMart. Can you imagine an eternity spent there?$7",
	
	"charles_dialogue.Mon8": "Did I ever tell you about the Case of the Creeping Mandrakes?#$e#Never mind, you look pretty busy right now. Some other time!$h",
	"charles_dialogue.Tue8": "You should come by the office sometime to hear about some cases we've solved.#$b#You never know when you might need to learn how to throw a hellhound off your scent.",
	"charles_dialogue.Wed8": "How are you and Edwin getting along, then? Good?",
	"charles_dialogue.Thu8": "Have you been to the Saloon lately? Gus' food always looks so good.#$e#Wish I could try some...",
	"charles_dialogue.Fri8": "I'm enjoying our time in Pelican Town!#$b#Especially since meeting such a good friend like you.$4",
	"charles_dialogue.Sat8": "Hey @! Say hi to %pet for me, would you?",
	"charles_dialogue.Sun8": "I had a gift I wanted to give you, but I lost it in my bag. Sorry, next time, yeah?$4",
	"charles_dialogue.Mon10": "If it isn't my favorite farmer, @! Need anything?",
	"charles_dialogue.Tue10": "I gotta say... Being here in Pelican Town has made feel the safest I've been in a long time...$#b#$4And you're a big part of that, @.",
	"charles_dialogue.Wed10": "I had a gift I wanted to give you, but I lost it in my bag. Sorry, next time, yeah?$4",
	"charles_dialogue.Thu10": "You should come by the office sometime to hear about some cases we've solved.#$b#You never know when you might need to learn how to throw a hellhound off your scent.",
	"charles_dialogue.Fri10": "Edwin's been too busy with research these days. His mind is brills, but sometimes I wish he took more breaks.",
	"charles_dialogue.Sat10": "The agency is open on weekends too! Ghosts don’t really have to sleep or rest... Sigh... But I wish we would take breaks sometimes.",
	"charles_dialogue.Sun10": "You know, you've been a real help to the town, @. Us included.",
	
	"charles_dialogue.spring_1": "Winter's finally over. Snow's nice and all, but it'll be good to see things 'round the valley growing again.",
	"charles_dialogue.summer_1": "You know, back when I was alive, summer was actually my least favorite season? I like it well enough now, though.",
	"charles_dialogue.fall_1": "Is fall as busy for you as it is for us?#$b#I dunno why, but it's like our caseload triples in the fall. Speaking of, gotta run!",
	"charles_dialogue.winter_1": "Cold out, innit? That's one good thing about being a ghost. I don't have to feel it anymore.$h",
	"charles_dialogue.spring_12": "Hey @! Excited for the Egg Festival tomorrow? 'S sorta like being a detective, innit, hunting for eggs instead of clues!",
	"charles_dialogue.summer_10": "I heard there's a Luau at the beach tomorrow. I don't hang around the ocean too much, but I might join!",
	"charles_dialogue.summer_27": "You know, I don't like the water much, but seeing the Moonlight Jellies tomorrow is definitely some kind of magic.",
	"charles_dialogue.fall_15": "Free food at the fair tomorrow! Sigh... I miss eating so much...",
	"charles_dialogue.fall_26": "I’m trying to convince Edwin to go in the Haunted Maze with me tomorrow. Maybe you'll have better luck.$h",
	"charles_dialogue.winter_7": "$7You're going to the Ice Festival tomorrow?#$b#Be careful...",
	"charles_dialogue.winter_24": "I'm so excited for tomorrow! I always feel like a little kid again when this time of year comes around. ",
	
		// EDWIN 
	"edwin_dialogue.Introduction": "Ah. You must be the new farmer then, judging by the state of your attire and tools? I am Edwin, one half of the Dead Boy Detectives.",
	"edwin_dialogue.divorced": "I cannot imagine what business you think you have with me, but I assure you, you're mistaken.",
	"edwin_dialogue.cc_Begin": "Charles and I have noted an uptick in activity and noise coming from downstairs. Is it your doing?",
	"edwin_dialogue.cc_Boulder": "I noticed quite a strange phenomenon last night while you living were sleeping. It's a shame how much you miss while attending to your bodily needs.",
	"edwin_dialogue.cc_Bridge": "I noticed quite a strange phenomenon last night while you living were sleeping. It's a shame how much you miss while attending to your bodily needs.",
	"edwin_dialogue.cc_Bus": "I hear the bus has been repaired.#$b#Of course, Charles and I can reach other destinations any time we wish simply by stepping through mirrors. But it must be a welcome change for you.",
	"edwin_dialogue.cc_Greenhouse": "My father's manor had a greenhouse, back when I was alive. I do remember enjoying the silence and the company of the plants, though I was scolded harshly for disturbing any of them.",
	"edwin_dialogue.cc_Minecart": "I hear the minecarts around town have been repaired.#$b#Of course, Charles and I can reach other destinations any time we wish simply by stepping through mirrors. But it must be a welcome change for you.",
	"edwin_dialogue.cc_Complete": "Congratulations on repairing the Community Center, though I'm curious as to how you accomplished it.#$e#Junimos, you say? I've never heard of them in any of my books. Strange.",
	"edwin_dialogue.movieTheater": "It will be nice to visit the cinema. I do have a special fondness for mystery films.",
	"edwin_dialogue.MovieInvite_Invited": "You wish to see a film together? I suppose I could spare an afternoon.",
	"edwin_dialogue.DumpsterDiveComment": "You do know that when we ghosts rummage in the bins, it is because we do not have concepts such as health or hygiene to worry about? The same does not apply to you.",
	"edwin_dialogue.SpouseStardrop": "",
	"edwin_dialogue.FlowerDance_Accept_Spouse": "",
	"edwin_dialogue.FlowerDance_Accept": "Quite different from the dances of my time, but I would be delighted to partake with you.",
	"edwin_dialogue.FlowerDance_Decline": "I do not make a habit of dancing, no matter what lies Charles has seen fit to spread about me.",
	"edwin_dialogue.GreenRain": "I've never seen such strange weather, save for when Charles and I angered a warlock back in '09.",
	"edwin_dialogue.GreenRain_2": "Is this to be a regular occurrence, then?#$b#I suppose it may be a good opportunity to explore the town without fear of scaring the townspeople.",
	"edwin_dialogue.eventSeen_handwrittenhello.dbda_crystalCactus": "Crystal wishes to see me? Is she upset?#$e#Very well, I shall talk to her today.",
	"edwin_dialogue.AcceptGift_(O)StardropTea": "You must know that we cannot—#$b#You mean I will be able to drink it? Goodness, I haven't had tea in over a century.#$b#Thank you, @. This means a great deal to me.",
	"edwin_dialogue.AcceptGift_category_cooking": "Charles and I are ghosts and cannot consume the food of the living.",
	"edwin_dialogue.eventSeen_handwrittenhello.dbda_Seance2": "I cannot thank you enough for your help in returning Niko to us.#$b#I missed her very dearly.",
	
	"edwin_dialogue.Mon": "I regret to inform you that we do not take on living clients. I'll thank you for not insisting.",
	"edwin_dialogue.Tue": "You live on %farm? Charles and I may have questions for you later concerning a recent case.",
	"edwin_dialogue.Wed": "Oh, @, it's you. I must urge you to quickly state your business. We are in a bit of a time crunch.",
	"edwin_dialogue.Thu": "Have you met Charles, my associate?#$e#I am sure he can aid you with whatever it is that you require.",
	"edwin_dialogue.Fri": "I'm afraid I have little time to talk at the moment. You understand.",
	"edwin_dialogue.Sat": "Unfortunately I am not at liberty to discuss our current or past cases with you, @. We value our clients' privacy quite highly.",
	"edwin_dialogue.Sun": "The work of a ghost never stops. Now if you'll excuse me, I'm quite busy.",
	
	"edwin_dialogue.Mon2": "Oh, @, it’s you again. If you insist on having conversations you can try to make yourself useful.",
	"edwin_dialogue.Tue2": "@, I see you enjoy spending time at the agency. I do hope you spare the same level of attention to your farm duties.",
	"edwin_dialogue.Wed2": "Have you talked to Charles, lately?#$b#I'm regrettably aware he would be delighted to talk to a living person.",
	"edwin_dialogue.Thu2": "Hmm... according to those runes...#$b#...but the readings do not match the phase of the moon...#$b#...perhaps if I take this into consideration...#$b#...Oh, @, I didn’t notice you standing there.",
	"edwin_dialogue.Fri2": "I cannot help but notice you spending time at the Agency.#$b#I assure you we would help with whatever investigation you needed if you were dead.",
	"edwin_dialogue.Sat2": "I don't suppose you have any pixie wings or small mammal bones on you?#$b#Shame. They make rather useful potion ingredients.",
	"edwin_dialogue.Sun2": "Have you visited the mines lately? Charles rather enjoys expressing his talents as the brawn there.#$b#With your stubborn attitude, I can only imagine you'll reach the bottom in no time at all.",
	
	"edwin_dialogue.Mon4": "Hello, @. I'm quite glad we got to know each other after all. You've helped me warm up to Pelican Town, as it were.",
	"edwin_dialogue.Tue4": "@, Charles and I were just discussing how helpful you’ve been since we’ve met.#$b#And I must say that I completely agree.",
	"edwin_dialogue.Wed4": "Hello, @. I must… apologize if I have been... harsh to you since we’ve met. I am not very good with people.",
	"edwin_dialogue.Thu4": "@, I noticed Charles has quite enjoyed his time in Pelican Town.#$b#And that is, in part, due to your acquaintanceship. In light of that I’d like to... thank you… for spending time with us.",
	"edwin_dialogue.Fri4": "@, I am aware my demeanor might come across as... rude. So I appreciate your insistence in making conversation.",
	"edwin_dialogue.Sat4": "Have you been to the library lately? I like to spend my afternoons there. I'd love to show you the best books I've found.",
	"edwin_dialogue.Sun4": "The mines are quite dangerous. You should bring Charles with you next time you go.",
	
	"edwin_dialogue.Mon6": "Pelican Town has been home to some anomalies lately, @.#$b#We’d appreciate any information you can share with us about them.",
	"edwin_dialogue.Tue6": "@, I’m glad to see you! I have some leads on a case and...#$b#...I’d like to brainstorm some actions with you and Charles...#$b#...if you’d be amenable to.",
	"edwin_dialogue.Wed6": "@, I hope you’re doing well! I couldn’t help but notice you spending time at the agency lately.#$e#If there are any books you’d like to borrow, I wouldn’t be against lending them to you.",
	"edwin_dialogue.Thu6": "Hello, @! How is the farm doing?#$b#I’m quite intrigued by some of the crops you’re growing, actually.#$b#If you have some spare time later, I’d be delighted to discuss farming techniques with you.",
	"edwin_dialogue.Fri6": "I’ve noticed some cats around, but I’ve yet to meet the Cat King of Pelican Town.#$e#I must say, I’m glad I’ve been spared this unpleasantry.",
	"edwin_dialogue.Sat6": "I've just finished this fantastic book. You should borrow it sometime so we can discuss it.",
	"edwin_dialogue.Sun6": "@, I can't help but notice your similarity to Charles in many respects.#$b#You are both beings of action, and I quite appreciate it in contrast to my own temperament.",
	
	"edwin_dialogue.Mon8": "Do you think Charles would like me to explore alternate outfits?#$b#Oh, you're right, of course he would hold me in high esteem regardless.",
	"edwin_dialogue.Tue8": "I wonder if I might visit %farm someday. With your invitation, of course. We could go for a walk about the property together.",
	"edwin_dialogue.Wed8": "I do find myself quite enjoying our talks, @. I hope you feel the same.",
	"edwin_dialogue.Thu8": "I've been experiencing so many difficult feelings as of late... How do you cope, @?",
	"edwin_dialogue.Fri8": "...Oh, it's only you, @. Pardon me, for a moment I was lost in thoughts of an unpleasant place. Excuse me.",
	"edwin_dialogue.Sat8": "If you keep up this sort of behavior, you may find yourself a probationary member of the agency soon.#$b#And that is not an invitation we extend very commonly.",
	"edwin_dialogue.Sun8": "I do admire your rather uncanny knack for gift-giving, @. It is a skill I have only perfected with Charles, and that took me several decades.",
	
	"edwin_dialogue.Mon10": "I always thought Charles would be the only best friend I'd ever need.#$b#I'm glad I was wrong.#l",
	"edwin_dialogue.Tue10": "I never thought you might grow on me this much, but now I cannot imagine my days without you.",
	"edwin_dialogue.Wed10": "You know, @, being among such good friends as you makes it difficult to remember the horrors that exist elsewhere.",
	"edwin_dialogue.Thu10": "You've been such a strong influence on the community, @.#$b#I shudder to think of how exhausting socializing with everyone in town must be.",
	"edwin_dialogue.Fri10": "Perhaps we might visit the lakeside sometime? Charles isn't overly fond, but I feel you might appreciate its beauty.",
	"edwin_dialogue.Sat10": "Have you investigated any interesting phenomena lately?#$b#Fascinating. You must tell me of your findings in more detail.",
	"edwin_dialogue.Sun10": "I daresay you've earned a place at the agency as much as Charles, Crystal or I have, with how much you've helped lately.",
	
	"edwin_dialogue.spring_1": "During my life I always had the most dreadful allergies in the spring. Being dead is decidedly more pleasant in this regard.",
	"edwin_dialogue.summer_1": "Summer means shorter nights. Less time for Charles and I to investigate the town unmolested, but also less time for more unsavoury creatures to create trouble.",
	"edwin_dialogue.fall_1": "Fall is an extremely busy season for us. Now if you'll excuse me.",
	"edwin_dialogue.winter_1": "Do be careful not to catch a chill, @. Too many of my classmates fell ill from lack of appropriate winter attire at St. Hilarion's.",
	"edwin_dialogue.spring_12": "My father would call the children of today unlicked cubs, or worse, for participating in such a rowdy festival as tomorrow's.#$e#Good thing he is no longer here to comment.",
	"edwin_dialogue.spring_23": "Charles has tried to teach me the flower dance a few times, but I'm afraid I've never quite mastered it. Nor do I enjoy the sensation of being watched.",
	"edwin_dialogue.summer_10": "London has no such traditions as tomorrow's. I must say the novelty of a luau is quite intriguing.",
	"edwin_dialogue.summer_27": "Every year I attempt to study the phenomenon of the creatures who visit Pelican Town at the end of summer, but their mystery continues to elude me.",
	"edwin_dialogue.fall_15": "I heard the Stardew Valley Fair is tomorrow.#$b#I suppose people should celebrate the town’s anniversary to their heart’s content.$u",
	"edwin_dialogue.fall_26": "Charles has been quite excited about the Haunted Maze tomorrow. Spirit's Eve is the busiest night of the year for us, but I suppose it couldn't hurt to participate, if only for him.",
	"edwin_dialogue.winter_7": "Charles has been quite dreading tomorrow's Ice Festival.#$b#I don't suppose you'll entertain a request not to go...?#$e#Of course not, that would be quite unfair. Besides, I'm sure nobody will get hurt...",
	"edwin_dialogue.winter_24": "Are you participating in the gift exchange tomorrow? I've already secured my gift to Charles.",
	
		// CRYSTAL
	"crystal_dialogue.Introduction": "Nice to meet you! I'm Crystal. I moved here recently for, um, work.#$e#Wait... you can see ghosts too? Oh, thank god.#$b#Yeah, me, Charles, and Edwin--they're the local overly co-dependent teenage ghosts, if you haven't met them yet--decided to open up a branch of the detective agency here.",
	"crystal_dialogue.cc_Begin": "I heard you have a whole quest to rejuvenate the community center and everything.#$b#Just between you and me, I think that wizard guy is kind of unhinged.$6",
	"crystal_dialogue.cc_Boulder": "I saw a bunch of shiny rocks in the river the other night.#$b#My parents used to have a lake house and I would spend hours panning for gold on the shore. Never found anything, though.",
	"crystal_dialogue.cc_Bus": "We can finally visit other towns? Good, I was feeling a little cooped up here.$h",
	"crystal_dialogue.cc_Minecart": "Sure, can't get a decent phone signal out here, but somehow you got a whole minecart system working. Good job, I guess.",
	"crystal_dialogue.cc_Complete": "The community center looks a lot nicer now. Charles and Edwin might be pissed about the increased foot traffic below them, though.",
	"crystal_dialogue.movieTheater": "I'm so busy I don't know when I'll ever have time, but it's nice to know we can go to the movies now.",
	"crystal_dialogue.firstVisit_Mine": "You look rough. You haven't been visiting those mines alone, have you?",
	"crystal_dialogue.GreenRainFinished": "That green rain was absolutely crazy. Are we sure it wasn't, like, poisonous?$6",
	"crystal_dialogue.MovieInvite_Invited": "I'd love to go to the movies with you.$h",
	"crystal_dialogue.DumpsterDiveComment": "I can't really judge, but when they found me dumpster diving, it was because I was possessed by a demon. Just saying.$6",
	"crystal_dialogue.FlowerDance_Accept_Spouse": "",
	"crystal_dialogue.FlowerDance_Accept": "I'd love to!$h",
	"crystal_dialogue.FlowerDance_Decline": "Umm, maybe next year.",
	"crystal_dialogue.divorced": "God, can't you just leave me alone?",
	"crystal_dialogue.eventSeen_handwrittenhello.dbda_Seance2": "Having Niko back is like... well, I never even thought it was possible.#$b#I can't ever pay you back, so... thank you.",
	
	"crystal_dialogue.Mon": "Winter is my favorite season. The valley is so still and quiet.",
	"crystal_dialogue.Tue": "Last night's episode of Murder After Dark was so crazy. Have you seen it yet?",
	"crystal_dialogue.Wed": "It's really great that you can see ghosts too. It gets a little old, having to pretend like I'm not talking to thin air.",
	"crystal_dialogue.Thu": "I have class all day on Tuesdays and Thursdays. Skipping a bunch of school really sucks when you have to make it up later.",
	"crystal_dialogue.Fri": "You moved here from the city? Do you miss anything about it?#$b#Sometimes I miss the nightlife, but also, that's not really me anymore.",
	"crystal_dialogue.Sat": "I can't wait until the weather is nice enough for sunbathing and swimming.",
	"crystal_dialogue.Sun": "The good thing about Pelican Town is that people don't really look at me too weirdly for talking to ghosts. I guess they're used to things being a little strange around here.",
	"crystal_dialogue.Mon2": "Ugh, I stayed up *way* too late last night helping the boys with our current case.",
	"crystal_dialogue.Tue2": "You haven't seen any medieval-looking ghost girls, have you? We're working on a case right now and she was a witness.",
	"crystal_dialogue.Wed2": "I think Abigail has a crush on Sebastian.#$b#Sorry, I'm trying to gossip less, but old habits...",
	"crystal_dialogue.Thu2": "I have class all day on Thursdays. Skipping a bunch of school really sucks when you have to make it up later.$2",
	"crystal_dialogue.Fri2": "It's a good thing the town is so small, because I never learned how to drive, and I can't mirror hop like the boys.",
	"crystal_dialogue.Sat2": "Thank God it's Saturday. I need a day to myself.",
	"crystal_dialogue.Sun2": "I don't think I've ever lived in such a small town before.#$b#Well, there was that one time my parents tried becoming hermits for a month as part of their latest performance art piece, but I don't think that counts.$6",
	"crystal_dialogue.Mon4": "The other teens haven't really invited me to hang out yet. Maybe it's because I'm still new to the valley...$s#$e#I hope it's not because they think I'm crazy.$6",
	"crystal_dialogue.Tue4": "I don't know whether to be relieved or concerned that my parents haven't called in weeks.$s#$b#Maybe they lost my number...",
	"crystal_dialogue.Wed4": "Did you know that over 200,000 murders have gone unsolved in the last four decades? And so many of the victims never move on...",
	"crystal_dialogue.Thu4": "$q Q_Navy_response1/Q_Navy_response2 Q_Navy_fallback#You don't know anything about 20th century naval battles, do you? I swear this class is going to kill me.$6
		#$r Q_Navy_response1 0 Q_Navy_reaction1#Uh, what?
		#$r Q_Navy_response2 10 Q_Navy_reaction2#Yes, actually... [give a detailed lecture about 20th century naval battles]",
	"crystal_dialogue.Q_Navy_reaction1": "Yeah, not surprising. Like, when am I ever gonna need to know this stuff?$6#$b#Thanks, though.",
	"crystal_dialogue.Q_Navy_reaction2": "Wow, I can't believe you just knew all that. You're a lifesaver!$h",
	"crystal_dialogue.Q_Navy_fallback": "Thanks again for your help with this assignment.$h",
	"crystal_dialogue.Fri4": "%pet is so cute. I wish I had a pet, but there's no way Jenny would let me lease.",
	"crystal_dialogue.Sat4": "Have you been exploring the mines? Charles says the lower levels are like, totally infested with poltergeists.",
	"crystal_dialogue.Sun4": "Hey, @. You wouldn't happen to know anything about the local mermaids, would you? Charles says we might have to talk to them about our case.",
	"crystal_dialogue.Mon6": "I've been wondering if I should learn how to cook. Gus makes great food and all, but when he's closed and I get home at 3am I'd like to not burn down the kitchen trying to make noodles.",
	"crystal_dialogue.Tue6": "Jenny would probably be happy to buy any fish you catch off you. Apparently most people here are pescatarian.",
	"crystal_dialogue.Wed6": "If Charles ever asks you to hold something while he digs in his bag, be careful.#$b#One time he handed me a sack full of goat hearts like it was nothing. So gross...$6",
	"crystal_dialogue.Thu6": "Juggling the agency and online classes can be a lot, but we're helping people, so it's worth it. ",
	"crystal_dialogue.Fri6": "When it gets too loud in my head, I like to visit the spa. It's quiet there.",
	"crystal_dialogue.Sat6": "I don't have much luck when it comes to growing plants like you. You should see the state of the tree I'm supposed to be taking care of.",
	"crystal_dialogue.Sun6": "How are things on the farm going? It must be a lot of work.",
	"crystal_dialogue.Mon8": "The other ghosts around town say that your farm should be, like, crazy haunted for how old it is. You haven't noticed anything strange, have you?",
	"crystal_dialogue.Tue8": "Do you have any tips for what to do when a tree looks like it's wilting?#$b#Like, if the tree was metaphorical. Kind of. #$b#Never mind.",
	"crystal_dialogue.Wed8": "I accidentally read Lewis' mind the other day when he handed me something.#$b#I did *not* need to know what he and Marnie get up to.",
	"crystal_dialogue.Thu8": "I've been thinking about studying law after I graduate. There has to be some accountability for the living, because the dead only have us.",
	"crystal_dialogue.Fri8": "If you see Edwin, can you tell him to get his ass over to my place?#$b#I think there are pixies in my vents again.",
	"crystal_dialogue.Sat8": "Hey, if Edwin ever gives you any grief about hanging around like an unwanted stray, tell me? He pulled that shit when I first met them too.",
	"crystal_dialogue.Sun8": "Being a psychic isn't everything it's cracked up to be.#$e#Sometimes I almost wish I could turn my brain off.",
	"crystal_dialogue.Mon10": "Do you want to go to the saloon sometime? Gus has pretty good milkshakes.$l",
	"crystal_dialogue.Tue10": "You should come over for movie night sometime. We won't even have to share popcorn with the boys.#$b#Just don't be surprised if Edwin guesses the ending, though...",
	"crystal_dialogue.Wed10": "I'm really glad I met you, @. I feel way less alone.$h",
	"crystal_dialogue.Thu10": "I don't really feel the need to go clubbing like I used to, but I do miss the dancing sometimes. Do you dance?$l",
	"crystal_dialogue.Fri10": "It's really great everything you've done for the town. I try to help people out, but I never feel like I can make up for what I've done in the past.",
	"crystal_dialogue.Sat10": "I had the weirdest dream last night. You were in it... Never mind.",
	"crystal_dialogue.Sun10": "The boys do care, a lot, it's just... sometimes they forget what it's like to be alive.#$e#Maybe in thirty years stupid teenage bullshit won't matter, but it feels like it does now, you know?",
	"crystal_dialogue.summer_1": "It's getting so hot out. I could use a day at the beach to cool off.#$b#Or at least somewhere with air conditioning.",
	"crystal_dialogue.fall_1": "Things are about to start getting busy in the spirit world.",
	"crystal_dialogue.winter_1": "All this cold, wet weather reminds me of London.",
	"crystal_dialogue.spring_12": "Are you excited for the flower dance? Kind of a weird, outdated holiday, but I guess it has its perks.",
	"crystal_dialogue.summer_10": "What should I bring to the potluck? I can't cook for shit.",
	"crystal_dialogue.summer_27": "I know they're not actually magic, but the dance of the moonlight jellies sure does feel like it.",
	"crystal_dialogue.fall_15": "I don't remember the last time I went to the fair before moving here. I must have been little.",
	"crystal_dialogue.fall_26": "I don't have a costume for the festival tomorrow...$s#$e#Things have been so busy at the agency I feel like I've spent all month running around.",
	"crystal_dialogue.winter_7": "Ice fishing isn't really my thing, but I bet you'd be great at it.",
	"crystal_dialogue.winter_24": "I'm so excited for the Winter Star feast tomorrow.#$b#I wonder who drew my name in the gift exchange.",
	
	// JENNY 
	"jenny_dialogue.Introduction": "So you're the new kid everyone has been flipping out over.#$b#Welcome to town, my hours are 9 to 6, now go away, I've got shit to do.",
	"jenny_dialogue.Mon": "Can't you see I'm busy, kid?",
	"jenny_dialogue.Tue": "What do you want? I've got a business to run.",
	"jenny_dialogue.Wed": "Do you need something?",
	"jenny_dialogue.Thu": "Listen, kid, I can't help you. Unless you want to order a sandwich or something, get lost.",
	"jenny_dialogue.Fri": "Sunday can't come soon enough. I need a fucking break.",
	"jenny_dialogue.Sat": "Some fucking raccoon or something keeps digging through my trash.#$3#That's what I get for settling down in the fucking countryside...",
	"jenny_dialogue.Sun": "Living in a tiny town sucks in a lot of ways, but at least the rent here is way lower.",
	"jenny_dialogue.Wed_6": "Whatever you're doing on that farm, it's working.#$b#I haven't seen such good produce in years.",
	"jenny_dialogue.Sun_6": "Ugh. My supplier is fucking late, *again*.$a",
	"jenny_dialogue.summer_1": "Ugh, it's too fucking hot out for this.",
	"jenny_dialogue.winter_1": "Ugh, it's too fucking cold out for this.",
	
	// NIKO 
	
	"niko_dialogue.Introduction": "I'm Niko! Thanks for helping my friends. It's great to meet you!",
	"niko_dialogue.cc_Begin": "",
	"niko_dialogue.cc_Boulder": "",
	"niko_dialogue.cc_Bus": "I heard we can take the bus to Calico Desert now!",
	"niko_dialogue.cc_Minecart": "I heard you fixed the minecarts.#$b#Now you can get around as fast as Edwin, Charles and I can mirror travel!",
	"niko_dialogue.cc_Complete": "The new community center looks so good!",
	"niko_dialogue.movieTheater": "Ooh, I hope the movie theater gets Japanese films. Or Scooby Doo.",
	"niko_dialogue.firstVisit_Mine": "You went down into the mines? I don't know if I'd be brave enough to do that...",
	"niko_dialogue.GreenRainFinished": "That green rain was so weird. Do you think magic had anything to do with it?",
	"niko_dialogue.MovieInvite_Invited": "I'd love to see a movie with you!$h",
	"niko_dialogue.DumpsterDiveComment": "@, don't you think that's a little gross?#$b#Wait, are you doing it for a case?",
	"niko_dialogue.FlowerDance_Accept_Spouse": "",
	"niko_dialogue.FlowerDance_Accept": "I'd love to dance with you!$h",
	"niko_dialogue.FlowerDance_Decline": "No thank you. I don't really like the attention...",
	"niko_dialogue.AcceptGift_(O)StardropTea": "Ooh, I love this!",
	"niko_dialogue.divorced": "Are you just here to break my heart again?$s",
	
	"niko_dialogue.Mon": "The valley is so pretty today.",
	"niko_dialogue.Tue": "Being a farmer looks like such hard work.",
	"niko_dialogue.Wed": "Pelican Town is so small. It's nice. Sometimes I get overwhelmed.",
	"niko_dialogue.Thu": "I like visiting Mick. He's got all sorts of stories if you take the time to listen.",
	"niko_dialogue.Fri": "Do you like mysteries? I saw a trailer for a new movie coming out that looked really good.",
	"niko_dialogue.Sat": "The library is my fourth favorite public building to visit.$h",
	"niko_dialogue.Sun": "Your farm is soooooo cute!$h#$b#Especially the way you decorated the farmhouse.$h",
	
	"niko_dialogue.Mon2": "Should I get a job? JojaMart is hiring, and I could use the money...",
	"niko_dialogue.Tue2": "I used to own more dolls, but they really freak Edwin out. Now I have stuffed animals instead.",
	"niko_dialogue.Wed2": "%pet is soooo cute! Say hi for me?#$b#The closest thing I've ever had to a pet was the dandelion sprites... but they were really mean.#$b#And also I could never let them out of their jar or else they would try to possess me again.#$e#It's a long story...",
	"niko_dialogue.Thu2": "Hi @! Have you harvested anything good lately?",
	"niko_dialogue.Fri2": "Hi @! I like your shirt. Is it new?",
	"niko_dialogue.Sat2": "I like taking walks in Cindersap Forest. I stay away from dandelions, though. Last time I wandered into a patch of them I ended up being possessed by a pair of dandelion sprites, who are *not* as cute as they sound. ",
	"niko_dialogue.Sun2": "I can't wait for fall. I love it when the leaves change color and the weather gets chilly.",
	
	"niko_dialogue.Mon4": "I'm so tired today. I was up too late reading last night, but I just had to finish the chapter!",
	"niko_dialogue.Tue4": "What's Gus serving for lunch tomorrow?#$e#Ever since coming back, sometimes food tastes like dust. Edwin says it's a ghost thing.",
	"niko_dialogue.Wed4": "Have the boys ever told you about the time Charles got possessed by a hellhound?",
	"niko_dialogue.Thu4": "You should grow more tea on your farm. I bet you could come up with some really interesting blends.",
	"niko_dialogue.Fri4": "I've got to get to the library soon. The newest installment of My Demon Lover just came out!#$b#The last one ended on such a bad cliffhanger...",
	"niko_dialogue.Sat4": "Charles has been showing me all sorts of cool things ghosts can do! I'm not very good at any of it yet, though.",
	"niko_dialogue.Sun4": "Edwin came over last night to watch scary movies, but I think he was only pretending to be scared.#$e#That's okay, I was plenty scared enough for both of us.",
	
	"niko_dialogue.Mon6": "Maybe I should go back to school like Crystal. It might be hard to register, though...#$b#Being only mostly-alive is hard.",
	"niko_dialogue.Tue6": "Last week I tried to mirror travel to %farm, but I ended up in Zuzu City. It took forever to figure out how to get back!",
	"niko_dialogue.Wed6": "I baked some cookies earlier! Although I couldn't taste the dough very well.#$b#You have to try them and tell me if they're good!#$action AddItem (O)223 1",
	"niko_dialogue.Thu6": "You always look so busy, @. I hope you give yourself time to relax sometimes!",
	"niko_dialogue.Fri6": "Sometimes I think Charles is way sadder than he pretends to be. I wish he knew it's okay to be sad sometimes.",
	"niko_dialogue.Sat6": "I think I'll visit the library later. I'm running out of reading material, unless I want to reread my manga collection for the third time.",
	"niko_dialogue.Sun6": "Do you ever have time to write letters? We could be penpals!",
	
	"niko_dialogue.Mon8": "I'm glad Crystal has her memories back. She's worried she's a bad person, but if you ask me, she's the same as always.",
	"niko_dialogue.Tue8": "I wonder if Crystal will be free to hang out later. We could go to the beach!#$b#Would you like to come?",
	"niko_dialogue.Wed8": "What's your favorite food you grow on your farm? I have some recipes I've been wanting to try. ",
	"niko_dialogue.Thu8": "I've never gone fishing. My dad always said he was going to take me, but then he died.",
	"niko_dialogue.Fri8": "Sometimes it's hard to make myself leave my room. Crystal really helped with that when I met her, though.",
	"niko_dialogue.Sat8": "Can I tell you a secret?#$e#I've never kissed anyone before.",
	"niko_dialogue.Sun8": "If you ever want to borrow some of my manga, just let me know.#$b#I'll pick ones I think you'd like!",
	
	"niko_dialogue.Mon10": "I should write to my mom... She lives all the way in Osaka. It's hard to find the words for what to write, though.",
	"niko_dialogue.Tue10": "It's been really nice helping the boys out with their cases again. Just like old times!",
	"niko_dialogue.Wed10": "Sometimes I have nightmares of Esther's house... Don't tell anyone else, please.$s",
	"niko_dialogue.Thu10": "If Edwin corrects you, that means he likes you. He also likes being right, but it means more when he takes the time to teach you something.",
	"niko_dialogue.Fri10": "I think it's neat that Crystal can read minds. Sometimes I wish I had that power.#$e#Then I could tell if someone is just pretending to be nice.",
	"niko_dialogue.Sat10": "Do you ever miss your old life? Sometimes I do, but I like this one way more.",
	"niko_dialogue.Sun10": "Roses are my favorite flower. Especially red ones! They're so romantic.",
	
	"niko_dialogue.spring_1": "I can't wait for the cherry trees to bloom. They're so pretty.",
	"niko_dialogue.summer_1": "It's too hot out. I think I might just stay inside today...",
	"niko_dialogue.fall_1": "I'm so happy it's finally fall.",
	"niko_dialogue.winter_1": "Winter is here! It's Edwin's birthday today, if you didn't know.",
	"niko_dialogue.spring_12": "Are you going to participate in the egg hunt tomorrow?",
	"niko_dialogue.summer_10": "I hope the potluck soup tastes good tomorrow.#$b#Or at least I hope that if it does taste bad, I can't taste it.",
	"niko_dialogue.summer_27": "Summer is ending, which means the moonlight jellies will visit soon.#$b#I hope I can spot a pink one this year.",
	"niko_dialogue.fall_15": "The petting zoo is my favorite part of the fair tomorrow.#$b#Marnie's animals are so adorable.",
	"niko_dialogue.fall_26": "Do you have a costume for Spirit's Eve?#$e#I thought it would be funny to wear a sheet and go as a ghost, but I didn't want to wreck any of mine by cutting holes in them.#$b#Plus they all have cute designs on them, so none of them are actually white.",
	"niko_dialogue.winter_24": "I love the holidays. In Osaka, my family and I always celebrated the new year by playing games before eating osechi.",
	
	//FESTIVALS
	// egg festival
	"Festivals.EggFestival.CharlesRowland": "The egg hunt always reminds me of the Rotten Egg Debacle of '98. Right, Edwin?$h",
	"Festivals.EggFestival.EdwinPayne": "If Charles and I could participate in the egg hunt, nobody else would stand a chance, frankly.$u",
	"Festivals.EggFestival.CrystalPalace": "I hate hardboiled eggs. The smell reminds me of that poltergeist we dealt with last year.",
	"Festivals.EggFestival.NikoSasaki": "I love the egg festival. It's like the valley comes alive!",
	"Festivals.EggFestival.CatKing": "Ugh, all these kids running around... remind me why I'm wasting my time here, again?",
	"Festivals.EggFestival.EstherFinch": "Hmph. Cute. Quaint. And I can't even get away with snatching one of the kids...#$e#Pretend you didn't hear that last part.",

	// flower dance
	"Festivals.FlowerDance.CharlesRowland": "I taught Edwin how to dance once. For fun, not that posh nonsense from way back when.",
	"Festivals.FlowerDance.EdwinPayne": "This reminds me of the horrid events my parents made me attend as a child. I cannot imagine dancing in front of an audience would be at all enjoyable.$s",
	"Festivals.FlowerDance.CrystalPalace": "I'm more used to the kind of dancing that happens in clubs, not whatever this is.",
	"Festivals.FlowerDance.NikoSasaki": "All the dancers look so pretty... I don't know if I could ever dance, though. I don't like too much attention on me.",
	"Festivals.FlowerDance.MontyFinch": "I wonder if Edwin would want to dance with me?#$e#Probably not...$s",
	"Festivals.FlowerDance.CatKing": "Are you gonna ask me to dance? You better have a pretty sweet offer.",
	"Festivals.FlowerDance.EstherFinch": "The flower dance might as well be older than me, it's so outdated. And I just *look* young and beautiful, honey.",

	// luau
	"Festivals.Luau.CharlesRowland": "Just looking at that soup is enough to make me feel sick.$s#$b#I'm glad I don't have to eat it.",
	"Festivals.Luau.EdwinPayne": "Remind me why we are here, again? Surely there are cases we could be working on instead.$s",
	"Festivals.Luau.CrystalPalace": "The soup kind of reminds me of what the housekeeper would throw together whenever I got sick.#$b#That's why I threw in some noodles--I always liked her noodle soup best.",
	"Festivals.Luau.NikoSasaki": "The soup smells soooo good! What are you putting in it?",
	"Festivals.Luau.MontyFinch": "It's really great that the whole town can come together to share the soup.#$b#The only meals I've ever shared were with a giant snake in Esther's basement.#$e#What?",
	"Festivals.Luau.CatKing": "Ugh, all this sand is going to get caught in my fur...",
	"Festivals.Luau.EstherFinch": "There has to be some kind of magic potential in a communal meal.#$b#Gross, good feelings, ew.",

	// moonlight jellies
	"Festivals.MoonlightJellies.CharlesRowland": "Being out on the water makes me nervous, but it's worth it to see the Moonlight Jellies.",
	"Festivals.MoonlightJellies.EdwinPayne": "Did you know, Pelican Town is the only region in the world home to such unique specimens? Fascinating.$u",
	"Festivals.MoonlightJellies.CrystalPalace1": "I'm so glad Niko is here to see this...",
	"Festivals.MoonlightJellies.CrystalPalace2": "I wish Niko were here to see this...",
	"Festivals.MoonlightJellies.NikoSasaki": "The moonlight jellies are sooooo beautiful! I'd take one home, but they belong in nature.",
	"Festivals.MoonlightJellies.MontyFinch": "I have to make it home before the moon rises... Esther doesn't like it when I'm out at night.",
	"Festivals.MoonlightJellies.CatKing": "You won't catch me out over the water. I'm plenty good back here.",
	"Festivals.MoonlightJellies.EstherFinch": "The jellies, you know, they make a wonderful skin serum. You should try it.",

	// fair
	"Festivals.Fair.CharlesRowland": "Have you been to the petting zoo yet? The chickens are pretty cute.$h",
	"Festivals.Fair.EdwinPayne": "Ridiculous. That fortune-teller is nothing compared to Crystal.$u",
	"Festivals.Fair.CrystalPalace": "Wow, did Edwin just compliment me? Is he running a fever?$h",
	"Festivals.Fair.NikoSasaki": "Charles helped me play the strength game. You should have seen everyone's faces when the bar hit maximum!$h",
	"Festivals.Fair.MontyFinch": "Do you think the petting zoo animals ever wish they could fly?",
	"Festivals.Fair.CatKing": "I'm only here to keep an eye on my cats. They love begging for peoples scraps at the fair.",
	"Festivals.Fair.EstherFinch": "This whole town should be under my thumb. All this joyful yelling, it's just sickening.",


	// spirit's eve
	"Festivals.Halloween.CharlesRowland": "It's the busiest night of the year for us. We're here to make sure nothing goes wrong, yeah?$u",
	"Festivals.Halloween.EdwinPayne": "You haven't attracted any curses or wronged any sprits lately, have you, @? I'd be careful on a night such as this one.",
	"Festivals.Halloween.CrystalPalace": "I don't care what Edwin says about keeping an eye on things--you couldn't pay me to go in that creepy-ass maze.#$b#I can't exactly walk through walls.",
	"Festivals.Halloween.NikoSasaki": "Eek! What was that?#$b#Oh, @, it's just you. Sorry, I'm a little jumpy.",
	"Festivals.Halloween.MontyFinch": "This is the one night a year Esther lets me do whatever I want, in the spirit of the season.",
	"Festivals.Halloween.CatKing": "Spirit's Eve is a very powerful night for cats.#$e#You and I could also make it a powerful night, what do you say?",
	"Festivals.Halloween.EstherFinch": "Ah, the smell of scared children. It's like coffee to me. Wakes the senses right up.",

	// festival of ice
	"Festivals.Ice.EdwinPayne": "Charles elected not to attend, and it's little question why. I myself am only here on matters pertaining to a current case.",
	"Festivals.Ice.CrystalPalace": "I'm kind of worried about Charles. He didn't look so good when Edwin and I left.",
	"Festivals.Ice.NikoSasaki": "Brr, it's cold out. I wish I had some tea to warm myself up.",
	"Festivals.Ice.MontyFinch": "Whee! Want to make snow angels with me?",
	"Festivals.Ice.CatKing": "I hate forests. Why are there so many trees? Ugh.$a",
	"Festivals.Ice.EstherFinch": "They should all be carving statues of me.",

	
	// feast of the winter star
	"Festivals.Christmas.CharlesRowland": "Edwin, Crystal and I already exchanged gifts this morning, but it's so fun seeing everyone else open up their presents.$h",
	"Festivals.Christmas.EdwinPayne": "Winter was always a rare bright spot during my childhood. The Christmas holidays meant a reprieve from St. Hilarion's halls.",
	"Festivals.Christmas.CrystalPalace": "It's so nice actually spending the holidays with people you like.#$b#My mom and dad used to drag me to every fancy party they could.#$e#When I turned thirteen I just started going home on my own as soon as they got drunk.",
	"Festivals.Christmas.NikoSasaki": "I hope I get a new issue of my favorite manga.",
	"Festivals.Christmas.MontyFinch": "Did you get any gifts this morning? What was your favorite?",
	"Festivals.Christmas.CatKing": "The only present I want to find under the tree... is you.#$e#Oh come on, it's just a little holiday flirting!",
	"Festivals.Christmas.EstherFinch": "All this... festive spirit... Ugh, it's sickening.",


	//SHOPS 
	"Shops.TM.Dialogue": "Ayup, I might have what you need.",
	"Shops.Jenny.Dialogue": "What do you want? I don't have all day.",

	
// STRINGS
	//CHARLES
	"charles_strings.Graveyard.000": "Hey, @. Fall is a busy season for us ghosts. Is something up?",
	"charles_strings.Soccer.000": "...twenty-nine, thirty, thirty-one...",
	"charles_strings.Music.000": "%Charles' music is too loud to hear you.",
	"charles_strings.Bag.000": "%Charles is busy sorting through his bag. Better not distract him.",
	"charles_strings.Reading.000": "Hey, @. Here to help with research?",
	"charles_strings.Batswing.000": "I like to practice in case we ever run into any monsters. 'S why I'm the brawn, innit?",
	"charles_strings.Waterside.000": "%Charles looks lost in thought and doesn't see you.",
	"charles_strings.Saloon.000": "Betcha you can't beat my high score. I've been playing since before you were born.",
	"charles_strings.Painting.000": "These runes can be a bit tricky if you don't know what you're doing. Edwin usually lets me handle them.",
	
	// CRYSTAL
	"crystal_strings.Meditation.000": "%Crystal is deep in a trance.",
	"crystal_strings.WokenUpTrance.000": "I can see it all...$u#$b#Sorry, @, how long have you been standing there?",
	"crystal_strings.SplishySplashy.000": "Hey, @. Want to dip your feet in?",
	"crystal_strings.Cellphone.000": "I can only get a few bars here. I wonder if Edwin has a spell for boosting my connection.",
	"crystal_strings.Reading.000": "Wow, could these old farts write anything more confusing? What the hell does 'myftical noftrum for all beaftly ills' even mean?$6",
	"crystal_strings.Reading.001": "Huh, did you know that ghosts who have died in graveyards can become trapped there for eternity?$6",
	"crystal_strings.Reading.002": "Ugh, this is giving me a headache.$s",
	"crystal_strings.NightMarket.000": "That guy in the robe keeps looking over at us...$6#$e#Do you think he can see ghosts?",
	
	// EDWIN 
	"edwin_strings.RuneCircle.000": "I wouldn't if I were you. There's no telling what effect it may have on the living.$u",
	"edwin_strings.Spells.000": "%Edwin is busy casting a spell.",
	"edwin_strings.Reading.000": "If you don't mind, I'm rather busy at the moment. Perhaps you could come back later.",
	"edwin_strings.Reading.001": "A fascinating take on stone tape theory... #$b#Oh, @, it's you. Can I help you?",
	"edwin_strings.Saloon.000": "$2I'll never know why Charles insists on coming here, especially during loud nights.#$b#Though I'm happy to tag along if it makes him happy.$h",
	"edwin_strings.Writing.000": "I'm afraid that if you don't have helpful information about our current case, I cannot entertain you at the moment. Perhaps try someone else?",

	// JENNY
	
	
	// NIKO 
	"niko_strings.Agency.000": "Hi, @! Do you have a case for us?",
	"niko_strings.Agency.001": "Hang on a second, @... If I don't write this down, I'll forget.",
	"niko_strings.WatchTV.000": "Have you seen this episode before? I could start it over for you if you want to watch.",
	"niko_strings.Noodles.000": "%*slurrrrrrrp*",
	"niko_strings.Reading.000": "%Niko is lost in her book and doesn't see you.",
	"niko_strings.Beachcombing.000": "I'm combing the beach for starfish or pretty shells. Have you seen any?",

	
	// MISCELLANEOUS STRINGS
	
	"StringsFromMaps.handwrittenhello.dbda_TNTConstruction": "Under construction.^^If you have a problem, blame the fucking witch that blew up my shop.^^-Jenny",
	"StringsFromMaps.handwrittenhello.dbda_TNTPrices": "PRICES^^Beef...$6/lb^Chicken...$4/lb^Pork...$5/lb^^NO REFUNDS",
	"StringsFromMaps.handwrittenhello.dbda_LighthouseSign": "Beach >\n Lighthouse @",
	"StringsFromMaps.handwrittenhello.dbda_Map.001": "Tragic Mick's",
	"StringsFromMaps.handwrittenhello.dbda_Map.002": "Open 9:00AM to 9:00PM",

	
// GIFT TASTES
	"CharlesRowland.love": "Oh, this is brills! Thanks, @!",
	"CharlesRowland.like": "Another item for the agency? Aces!",
	"CharlesRowland.dislike": "Oh... I guess we could find a use for this at the agency...",
	"CharlesRowland.hate": "Is this some sort of joke? It's not funny, mate.",
	"CharlesRowland.neutral": "Cheers, mate.",

	"CrystalPalace.love": "Wow, @, I don't even know what to say. Thank you!",
	"CrystalPalace.like": "Thanks. You didn't have to do this.",
	"CrystalPalace.dislike": "This is, uh... are you sure?",
	"CrystalPalace.hate": "What the fuck, @?",
	"CrystalPalace.neutral": "Thanks, @.",
	
	"EdwinPayne.love": "You... wish for me to have this? Are you certain? I find myself quite speechless... Thank you, @.",
	"EdwinPayne.like": "Excellent find, @. Thank you very much.",
	"EdwinPayne.dislike": "Ah. Very well, @, if you insist...",
	"EdwinPayne.hate": "I don't appreciate this, @.",
	"EdwinPayne.neutral": "Thank you.",
	
	"NikoSasaki.love": "This is so, so, so, so amazing, @!",
	"NikoSasaki.like": "Oh, this is pretty cool, thank you!",
	"NikoSasaki.dislike": "Oh... okay...",
	"NikoSasaki.hate": "I don't really want this... but thanks, I guess.",
	"NikoSasaki.neutral": "For me? Thank you!",
	
	"JennyButcher.love": "Who told you I like this?$a#$b#Never mind... thanks.",
	"JennyButcher.like": "You have good taste, kid.",
	"JennyButcher.dislike": "Whatever.",
	"JennyButcher.hate": "What the fuck, @?",
	"JennyButcher.neutral": "Thanks.",


// EVENTS 
	"edwinhearts2.0": "Ah, @. You haven't come at the best time.#$b#I'm in the middle of mixing a rather delicate potion.#$b#I suppose you can stay, if you'd like to watch.",
	"edwinhearts2.1": "If I have followed the instructions correctly, then this potion will allow us ghosts to temporarily consume food and drink for the duration.$u#$b#I must admit, seeing the kinds of crops you grow on your farm has tempted even me.",
	"edwinhearts2.2": "That's strange.#$b#This clearly says to add the liverwort after stirring, when I could have sworn...",
	"edwinhearts2.3": "Edwin's potion went wrong.#Laugh at Edwin#Help him clean up",
	"edwinhearts2.4": "This is embarrassing. Thank you, @.$6#$b#$6You weren't too close to the splash, I hope?",
	"edwinhearts2.5": "Good. Now, if you'll excuse me, I should dispose of the remains of this ill-advised experiment before Charles returns.$6",
	
	"charleshearts2.0": "Hey, @. How are things going on the farm?#$b#I'm just sorting through my bag.",
	"charleshearts2.1": "It's been a bit of a mess in there recently, but I think I’ve got some sort of a system going.#$b#I've had to reorganize to fit all the new stuff we’ve got since coming to town.",
	"charleshearts2.2": "Check this out.",
	"charleshearts2.3": "I come in here sometimes when I need to think.#$b#It's good for whenever I need to get away, you know?",
	"charleshearts2.4": "It's safe, don't worry.$h#$b#Come on over.",
	"charleshearts2.5": "Sorry for the mess... I haven't really had anyone in here before.",
	"charleshearts2.6": "Sorry for the mess... I haven't really had anyone in here before.",
	"charleshearts2.7": "Yeah, you should really clean up in here...",
	"charleshearts2.8": "I don't mind.",
	"charleshearts2.9": "Yeah, you're probably right...",
	"charleshearts2.10": "Just wait until you knock over the jar of bees. Speaking from experience, you only make that mistake once.$h",
	"charleshearts2.11": "Anyway, even if I'm not around, feel free to come in here if you need a minute away. Just don't get lost!$h",
	
	"niko_hearts4.0": "Allow me to demonstrate.",
	"niko_hearts4.1": "Ah, @, good morning. Charles and I were just about to teach Niko about some of the so-called 'ghost rules', seeing as she is only partially alive now.#$b#One of the better perks is the ability to mirror travel; observe.",
	"niko_hearts4.2": "'S alright, @, he just popped across to Niko's room. Look.",
	"niko_hearts4.3": "See? Simply concentrate on your destination, and with practice, you will be able to travel quickly and reliably.#$b#And, as you have observed, bring objects through mirrors with you as well.$h",
	"niko_hearts4.4": "I *have* always been jealous of you being able to travel through mirrors.$h",
	"niko_hearts4.5": "There's gotta be *some* perks to being dead.",
	"niko_hearts4.6": "Go ahead, Niko. Try to move from that mirror to the other.",
	"niko_hearts4.7": "Okay... here goes...",
	"niko_hearts4.8": "...#$b#...Niko?$s",
	"niko_hearts4.9": "Bloody hell, where's she gone?$7",
	"niko_hearts4.10": "I knew I should have accompanied her on her first trip. This is my fault.$s",
	"niko_hearts4.11": "It's alright, mate, we'll get her back.$9#$b#@, you stay here in case she finds her own way back.#$b#Edwin, remember when I first started, and I kept getting lost? Let's start by checking the usual haunts, yeah?",
	"niko_hearts4.12": "Yes, I suppose we shall have to start somewhere-",
	"niko_hearts4.13": "Niko! You alright?$7",
	"niko_hearts4.14": "Oh my gosh! I don't know where I ended up, but that was scary!$s",
	"niko_hearts4.15": "I'm sorry, Niko. I should have guided you more on your first attempt.$s",
	"niko_hearts4.16": "It's okay. But if it's alright with you, I think I'd like to be done practicing for now.",
	"niko_hearts4.17": "Of course. Why don't we finish watching that television programme you showed me last week?$h",
	"niko_hearts4.18": "Charles, @, I shall see you later.",
	"niko_hearts4.19": "Bye guys!",
	"niko_hearts4.20": "Phew, glad that's sorted.$h#$b#I was worried for Niko, but for a second there I thought Edwin was going to go spare.$s#$b#Just between you and me, he's been pretty... jumpy, I guess, when it comes to Niko.$s#$b#It's just 'cause he doesn't want to lose her again, yeah?#$b#We'll work on mirror travel another time.#$b#While it's just us, d'you wanna take a look at this new ring we got as payment? It's supposed to make you invisible...$h",
	
	"edwinhearts5.0": "-and when we consider the fact that she wasn't at home at the time...",
	"edwinhearts5.1": "Ah, @.  Good to see you.$h",
	"edwinhearts5.2": "Maybe you can solve this one for us, mate.$h#$b#Edwin and I have been talking each other 'round in circles all day with this case.",
	"edwinhearts5.3": "A client came to us late last night in tears.#$b#She herself died almost ten years ago in a traffic accident, while her husband survived.",
	"edwinhearts5.4": "She never moved on 'cause she wanted to look after her husband, yeah? You following?",
	"edwinhearts5.5": "As to why she sought our help: her husband has recently gone missing.#$b#He was last seen in their town's graveyard.$u#$b#She reported that there were no signs of a struggle...#$b#...besides a few drops of blood in the dirt, which she admitted could have belonged to a wild animal.",
	"edwinhearts5.6": "Don't forget that people had been hearing weird noises at night the whole week.#$b#Sort of a weird howling, not like any animals they'd heard before.",
	"edwinhearts5.7": "Yes, precisely. However, the unusual thing is that none of the graves were disturbed.",
	"edwinhearts5.8": "Normally with a graveyard abduction you expect to see a necromancer, or a haunting, something like that.",
	"edwinhearts5.9": "Right, so we've tried locator spells, scrying, everything you can think of to find him.#$b#Edwin thinks he was taken by the fae...#$b#...and I reckon it was some sort of hellhound hunting him down, like that's why we can't find him.",
	"edwinhearts5.10": "Well, @? You've heard the details of the case.#$b#What do you think took our client's husband?",
	"edwinhearts5.11": "What do you think took our client's husband?",
	"edwinhearts5.12": "A troupe of fae",
	"edwinhearts5.13": "A hellhound",
	"edwinhearts5.14": "A vampire",
	"edwinhearts5.15": "None of these, he just got lost",
	"edwinhearts5.16": "Just as I suspected.",
	"edwinhearts5.17": "Ah, you believe Charles' theory.",
	"edwinhearts5.18": "We hadn't even considered that. Very astute, @.",
	"edwinhearts5.19": "I suppose it's possible... though not very common, in our line of work.",
	"edwinhearts5.20": "Thank you, @. You've been surprisingly helpful.#$b#We shall take your analysis into account.",
	"edwinhearts5.21": "Hey, keep it up, and you might even become a junior member of the agency!$h",
	
	"edwinhearts10.0": "Hello, @. You got my message, I presume?",
	"edwinhearts10.1": "Since we've grown closer, I've been...#$b#...Well, I've been realizing some things.#$b#Your friendship means a great deal to me.",
	"edwinhearts10.2": "I never anticipated growing so attached to anyone when Charles and I came to Pelican Town, but you have embedded yourself quite firmly in my heart.",
	"edwinhearts10.3": "Where is that spellbook...#$b#Ah, here it is. Charles must have done some reorganizing when fiddling with his bag of tricks.",
	"edwinhearts10.4": "@, I... I find I cannot bear the thought of you getting hurt, and being unable to stop it.#$b#I know your adventures can be dangerous, and it would put my mind at ease to know that I have made you at least a bit safer.",
	"edwinhearts10.5": "Would you allow me to cast a spell of protection on you?#$b#It should lessen any damage you take.#$b#I've also modified it with my own flair to improve your luck.",
	"edwinhearts10.6": "Excellent. This shall only take a tick.",
	"edwinhearts10.7": "That should do it.$h#$b#Thank you, @.",
	
	"Niko1.0": "I do not see why you find this so difficult, Crystal. You were able to defeat that forest elemental we encountered quite handily.",
	"Niko1.1": "Don't be so hard on her, mate. Not exactly a life-and-death situation, is it?",
	"Niko1.2": "Perhaps we ought to make it one, then, to ensure expediency...$3",
	"Niko1.3": "I'm sorry, when did you become a psychic again?$6#$b#Oh, you're not? Then be quiet and let me think.$6",
	"Niko1.4": "Oh, hey, @. We're just helping Crystal practice.#$b#Edwin thought he saw something odd in the graveyard the other day, so she's gonna try and read it.",
	"Niko1.5": "I think I see something...$u",
	"Niko1.6": "I can feel something... sad.$u",
	"Niko1.7": "It's... it's lonely, whatever it is. I can't tell...$u",
	"Niko1.8": "It's another ghost, but... wrong, somehow.$u",
	"Niko1.9": "Well, that sounds like a case for us, don't it?$h",
	"Niko1.10": "Quite. We shall need to prepare.#$b#@, you may as well come along on this case, if you wish.#$b#You can expect a letter from us shortly with further instructions.",
	
	"niko_hearts2.0": "Oh, hi, @!#$b#I was just writing. I'm a little stuck on this part, though.$a#$b#Actually, maybe you could help? You have really good ideas!",
	"niko_hearts2.1": "Okay, so where do you think the scene should take place?",
	"niko_hearts2.2": "Pick a place.",
	"niko_hearts2.3": "Oh, interesting, okay. What do you think the characters should see there?",
	"niko_hearts2.4": "They should encounter a...",
	"niko_hearts2.5": "I never would have thought of that!#$b#Thanks, @. I think I only need one more thing...",
	"niko_hearts2.6": "It's supposed to be a romance, but I don't know what would spark the two of them getting together.#$b#How do you think it should happen?",
	"niko_hearts2.7": "How did Niko's characters fall in love?#They",
	"nikohearts2.16": "together until sunset.#They",
	"nikohearts2.17": "together all day.#They",
	"nikohearts2.18": "every night",
	"nikohearts2.19": "their home.",
	"niko_hearts2.8": "Oh, that's so romantic!$l#$b#I know exactly what to write now. Thanks so much, @.",
	"niko_hearts2.9": "As soon as I'm done, do you want to read it?",
	"niko_hearts2.10": "Will you read Niko's story when she's done?",
	"niko_hearts2.11": "Yes",
	"niko_hearts2.12": "No",
	"niko_hearts2.13": "Great! I'll let you know when it's finished.$h",
	"niko_hearts2.14": "Oh... that's okay, you don't have to.$s",
	"niko_hearts2.15": "Thanks again for the help, @. See you later!",
	
	"nikohearts6.0": "Hi @!#$b#I actually have a surprise for you, but you're a little early.$h",
	"nikohearts6.1": "Here. I made cookies! You're always so sweet, so I wanted to make something sweet for you.$h",
	"nikohearts6.2": "Well? How do they taste?",
	"nikohearts6.3": "Oh no...$s#$b#I used a recipe and everything, but I couldn't taste any of the ingredients!$s",
	"nikohearts6.4": "Most of the time food just tastes like sand to me now. Edwin and Charles said that's how it is for ghosts all the time, but I hate it!$s#$b#How am I supposed to bake for my friends, or go out to eat with them, or have any of the food you grow on your farm?$s",
	"nikohearts6.5": "I'm glad that you guys brought me back, but sometimes it really sucks.$s",
	"nikohearts6.6": "It's okay, the cookies weren't that bad.",
	"nikohearts6.7": "Maybe you can't always taste the food, but you can still share the experiences with people.",
	"nikohearts6.8": "You should be glad you can't taste your horrible attempts at baking.",
	"nikohearts6.9": "You're just trying to make me feel better.$s#$b#But thank you, I guess.",
	"nikohearts6.10": "I guess you're right... Charles and Edwin still have fun whenever Crystal eats in front of them.#$b#And I can still smell and touch things, so maybe I could just imagine being able to taste things.",
	"nikohearts6.11": "Sorry I screwed the cookies up so bad. You probably hate me.$s",
	"nikohearts6.12": "Anyway, I'll just have to keep practicing.#$b#I'll make you the best cookies ever, even if it takes a hundred batches!",
	
	"nikohearts10.0": "@! You got my letter?$h",
	"nikohearts10.1": "You know, ever since moving to the valley...#$b#It's been really hard trying to adjust. Not just to what I am now, partly alive and partly dead...#$b#But all these new people, new places, well...#$b#Sometimes it's enough to make me want to stay in my room for days on end.#$b#It's a lot easier to pretend that I'm not scared that way.",
	"nikohearts10.2": "But you've made it a lot easier for me to put myself out there. You're always so nice, and encouraging, and I see how hard you work to make the town a better place.$l#$b#Which is why I wanted to give you this...",
	"nikohearts10.3": "I'm still trying to get the hang of mirror traveling, but maybe this will help you get around a little easier!#$b#It's enchanted to teleport you to my room. That way we can hang out more!$h",
	
	"crystalhearts1.0": "*sighhhh*...$s#$b#Do you ever think about death?$s",
	"crystalhearts1.1": "Like, what happens when we move on. Obviously some people don't, like Charles and Edwin...$s#$b#...And I'm glad they get a second chance, because they didn't deserve to die so young. Like, what a shitty hand to get dealt.$s#$b#But... I had a friend...$s#$b#She didn't get a second chance.$s",
	"crystalhearts1.2": "She's in a better place.",
	"crystalhearts1.3": "Nothing happens when we move on. We just cease to exist.",
	"crystalhearts1.4": "I'm sorry. She was lucky to have a friend like you.",
	"crystalhearts1.5": "Yeah... I'd like to think so.$s",
	"crystalhearts1.6": "That's so depressing... but probably true. I don't know.$s",
	"crystalhearts1.7": "That's nice of you to say.$s#$b#I'm not so sure, though...$s",
	"crystalhearts1.8": "It was my fault she died. The spell was coming straight for me, but Niko...$s#$b#She jumped right in front of it. There wasn't even time to think.$s",
	"crystalhearts1.9": "This used to be hers.$s",
	"crystalhearts1.10": "You can have it. It brings back too many memories.$s#$b#I'll see you later.$s",
	
	"crystalCactus.0": "Crystal? Are you decent?$7#$b#I would not want a repeat of last April's Topless Incident...$7",
	"crystalCactus.1": "That was entirely your fault for not warning me before you hopped through my mirror.$6#$b#But yes, you can come in.",
	"crystalCactus.2": "I have something for you. @ assisted me in procuring it.$h",
	"crystalCactus.3": "Now if you'll excuse me, I must return to the office.#$b#Charles seemed quite determined in trying to pull a rabbit out of the magic hat we received as payment last week, and I'm anxious to see the results of his efforts.$s",
	"crystalCactus.4": "Oh, hey, @. You just missed Edwin.",
	"crystalCactus.5": "He just gave me this cactus...$7#$b#He got the seeds from you, I guess? That's cool.$7",
	"crystalCactus.6": "I wonder why a cactus, though.$7",
	"crystalCactus.7": "I wonder why a cactus, though.#He thinks it's prickly and needs a lot of attention, just like you.#He thinks it's resilient, just like you.",
	"crystalCactus.8": "You think? That's really sappy, even for him.$6",
	"crystalCactus.9": "But thank you.$h#$b#If you see him before I do, tell him to come over?#$b#If he thinks he can get away with a handshake instead of a hug after this, he's insane.$h",
	"crystalCactus.10": "Hey, while you're here, mind giving me some tips?#$b#You've got way more of a green thumb than me, and I don't want to kill this poor cactus.",
	"crystalCactus.11": "You gave Crystal some tips on how to care for her new cactus.",
	
	"CrystalCactusMean.0": "What's that supposed to mean?$a",
	"CrystalCactusMean.1": "I think you should go. Since I'm so terrible to be around.$a",
	
	"crystalhearts10.0": "@! You made it.$h",
	"crystalhearts10.1": "Where are we?",
	"crystalhearts10.2": "This is awesome!",
	"crystalhearts10.3": "This is scary...",
	"crystalhearts10.4": "We haven't actually gone anywhere.#$b#Or at least, our bodies haven't.#$b#You know how I'm a psychic? I brought you into my mind.",
	"crystalhearts10.5": "Thanks!$l#$b#It's pretty incredible, isn't it? It's a representation of my mind.#$b#Don't worry, we haven't actually gone anywhere--it's just a projection.",
	"crystalhearts10.6": "Don't be afraid! It's totally safe.#$b#This is just a manifestation of my psychic powers.#$b#I'll put you back safe and sound, don't worry.",
	"crystalhearts10.7": "This tree... It represents me, and the connection I have to all my ancestors.",
	"crystalhearts10.8": "It's my responsibility to take care of it, but I haven't been doing a great job of it...$s",
	"crystalhearts10.9": "But you know what? I'm really proud of myself.#$b#It feels weird to say, especially when a lot of things in my life have been really fucked up, but I am.#$b#A lot of it was my fault. Remember how I told you I used to be such a shitty human being?",
	"crystalhearts10.10": "The guilt was eating me alive.#$b#It turns out that even for a psychic--maybe *especially* for a psychic--it's really hard to get out of your own head.$3#$b#What helps is thinking about my friends, and you've been a big part of that.#$b#I see the way you run around helping people. It reminds me to focus on doing good here, now, instead of dwelling on the past.",
	"crystalhearts10.11": "To thank you, and as a reminder from me to you about doing good, I wanted to give you this.",
	"crystalhearts10.12": "And feel free to come here whenever you need a break. Maybe we could hang out in here together sometime?$l",
	
	"edwinhearts7.0": "Oh, hello, @. I was just browsing the shelves for any books I haven't read yet.#$b#I don't suppose you have any recommendations?",
	"edwinhearts7.1": "What book would you recommend to Edwin?#Murder at Magnolia Mansion#My Life as a Teenage Werewolf#1001 Curses and Cures",
	"edwinhearts7.2": "Fascinating. I shall give it a try.",
	"edwinhearts7.3": "I'm glad we ran into each other, as it happens.#$b#This is... difficult for me to say, but...$s#$b#I apologize. I treated you quite rudely upon our first acquaintance... and for some time thereafter.$s",
	"edwinhearts7.4": "I'm glad in the end that you have remained steadfast in your attempts to become friends.$h",
	"edwinhearts7.5": "Can you forgive me for acting so coldly toward you?$2",
	"edwinhearts7.6": "Can you forgive me for acting so coldly to you?#Yes#No",
	"edwinhearts7.7": "I'm relieved.$h#$b#And here - will you accept this book as a token of apology from me?$h",
	
	"notForgive.0": "I suppose that's fair.#$b#Please accept my further apology for having asked.$s",
	
	"charleshearts7.0": "*sniff*... Hey, @.",
	"charleshearts7.1": "Sorry, I'm not really good company right now...#Sorry, I'll leave you alone.#That's okay. Can I stand here with you for a bit?",
	"charleshearts7.2": "Yeah, sure. *sniff*.$s",
	"charleshearts7.3": "Do you ever feel like you just can't do things right some days?$s",
	"charleshearts7.4": "Sorry, that was kind of heavy.$s#$b#I just mean, like... it's rough, sometimes, being dead and all.$s#$b#I usually don't mind, not really, because I've got Edwin and I've got the agency and that's all good, you know?#$b#But then I remember how my mates chased me into that lake, or how my dad used to hit me...$s",
	"charleshearts7.5": "Sometimes it's like he's still around, yelling in my ear about how I'm gonna mess this up too.$s#$b#And if I mess up, like, that's it, it's over, you know?...$s#$b#I'd lose Edwin, I'd lose *everything*.$s",
	"charleshearts7.6": "You should focus on the positive things about the present.",
	"charleshearts7.7": "You should try to forget the past.",
	"charleshearts7.8": "It's okay to feel sad sometimes.",
	"charleshearts7.9": "Yeah, you're right. I know I shouldn't worry so much about this sort of thing...",
	"charleshearts7.10": "Yeah, you're right. I know I shouldn't worry so much about this sort of thing...",
	"charleshearts7.11": "Yeah... you sound just like Crystal. I promise I'm trying, alright?",
	"charleshearts7.12": "And it helps making friends like you, don't it?$h#$b#Thanks for listening, @.",
	
	"crystalhearts4.0": "Oh, hi. You're... Crystal, right? Pretty name.",
	"crystalhearts4.1": "Kind of a shame that your face doesn't match...#$b#Come to me if you want a makeover, okay?",
	"crystalhearts4.2": "Sure, if I ever want to learn how to look faker than a Barbie doll, I'll let you know.$a",
	"crystalhearts4.3": "Hmph! I was just trying to help!$a",
	"crystalhearts4.4": "Oh my god, why did I say that? What the hell is wrong with me?$2",
	"crystalhearts4.5": "\"\"",
	"crystalhearts4.6": "She deserved it.",
	"crystalhearts4.7": "That was rude. You should apologize.",
	"crystalhearts4.8": "No, she didn't deserve that...$2#$b#She just reminded me of who I don't want to be anymore.$2",
	"crystalhearts4.9": "Yeah, you're right...$2#$b#She just reminded me of who I don't want to be anymore.",
	"crystalhearts4.10": "It's a really long story, but basically, I lost all my memories a few months ago...$2#$b#I got them back eventually, but remembering that I used to be actually really shitty to a lot of people?$2#$b#It wasn't fun, let me just say that.$2#$b#I could try and make excuses for it...$s#$b#My parents were never home, I was acting out to get attention, I didn't have good role models...$s#$b#But it doesn't change the fact that I hurt a lot of people for a long time.$s",
	"crystalhearts4.11": "...Do you think I can make it up to Haley?$2",
	"crystalhearts4.12": "Do you think I can make it up to Haley?#You should apologize and take her up on the offer.#You should apologize with a gift.#You should forget about it. Neither of you meant to be rude.#You should explain to her why you reacted like that.#I'm staying out of this.",
	"crystalhearts4.13": "Okay. I'll think about it.",
	"crystalhearts4.14": "Thanks for the advice, @. I should get going.",
	
	"laughAtEdwin.0": "I don't understand. It should have worked...$6#$b#You've distracted me, @.$6#$b#I don't need your help cleaning this up, so kindly leave me to my embarrassment.$6",
	
	"Seance.0": "Ah, you decided to join us, @.#$b#This could be dangerous, but I am confident in your ability to handle yourself.#$b#You certainly handle that weapon of yours well when adventuring.",
	"Seance.1": "#I was born ready.#Maybe this isn't a good idea...",
	"Seance.2": "Edwin, stop scaring ${him^her^them}$.#$b#It'll be fine, yeah? That's what I've got this for.$u",
	"Seance.3": "Can we hurry up? It's like, freezing out here.#$b#@ and I can still feel the cold, you know.",
	"Seance.4": "Very well. Let us call forth the spirit you saw in your vision.#$b#If you wouldn't mind using your psychic powers to call it as well?",
	"Seance.5": "We call forth the spirit that is haunting the Pelican Town graveyard.#$b#Be you benevolent or restless, confused or lost, come forward.",
	"Seance.6": "We want to help you.#$b#Come on, it's alright.",
	"Seance.7": "It worked!",
	"Seance.8": "Can you hear us?",
	"Seance.9": "The connection is fading...#$b#Quick, Crystal, can you strengthen it with your powers?",
	"Seance.10": "I'm trying, but I can barely feel the ghost.",
	"Seance.11": "Shit! I lost it.",
	"Seance.12": "Can you get it back?$7",
	"Seance.13": "We shall have to strengthen its connection to the physical plane.$u#$b#This will require some research...$u",
	"Seance.14": "Another case for the Dead Boy Detectives!$h#$b#@, Crystal, it's pretty late. Can I walk you home?",
	
	"Seance2.0": "Is everyone ready?#$b#There may be unexpected consequences to performing the strenghtening ritual. We ought to be on our guard.$u",
	"Seance2.1": "Got my bat ready, mate.$u",
	"Seance2.2": "Let's bring this ghost home.",
	"Seance2.3": "Very well. Let us begin.",
	"Seance2.4": "I am addressing the spirit who haunts the Pelican Town graveyard.#$b#The spell I am currently performing will allow you to anchor yourself to the town so that we may speak.",
	"Seance2.5": "If you reach out, we can help you, yeah?",
	"Seance2.6": "It's working! I can feel that she's stronger now.$u",
	"Seance2.7": "She? Can you ask her who she is?",
	"Seance2.8": "Charles, Crystal, @! I sense that our ritual has attracted unwanted attention!",
	"Seance2.9": "@ and I will hold them off. Crystal, Edwin, keep anchoring the ghost!$9",
	"Seance2.10": "Please! Tell us who you are so we can help you!$u",
	"Seance2.11": "...$u#$b#...Niko?$s#$b#Oh my god, Niko!$h",
	"Seance2.12": "You guys found me!$h",
	"Seance2.13": "Niko? How is this possible?$s#$b#After you died... we ran to escape Death herself at Esther Finch's house...$s#$b#You became a ghost after dying?",
	"Seance2.14": "I wasn't a ghost. I was sort of somewhere in between, I think?$6#$b#Don't worry, I know you guys would never leave me, not on purpose.#$b#I'd really love to tell you the whole story right now, but that ritual was exhausting.$6",
	"Seance2.15": "You're right. We're just happy you're back. The whole story can wait.",
	"Seance2.16": "Thanks, guys.$h#$b#And you made a new friend!$h",
	"Seance2.17": "Did you help bring me back? Thank you!$h",
	"Seance2.18": "Yeah, @ was a huge help. We couldn't have brought you back without ${him^her^them}$!$h#$b#We'd better get you all home, though. It's pretty late.",
	"Seance2.19": "Yes, we shall hear the whole story another day.$u#$b#Top whole job, everyone.$h",
	
	"charleshearts10.0": "...but what color do you think ${he'd^she'd^they'd}$ like...?",
	"charleshearts10.1": "Don't ask me, Charles. You're the one who insisted on this gift.",
	"charleshearts10.2": "@! I didn't see you there, haha...$l",
	"charleshearts10.3": "Well I guess now that you're here...",
	"charleshearts10.4": "I was going to surprise you, but... here.",
	"charleshearts10.5": "It's been really aces being your friend.#$b#Ever since we came to Pelican Town, you've made it easier, you know?#$b#You always listen, even when I can't really explain what I'm feeling...#$b#And it's like you always know how to cheer me up. And...#$b#I just thought I'd come here and find something to say thank you.$h#$b#It's an enchanted amulet. Supposed to make you better at fighting or something.",
	"charleshearts10.6": "You like it, then?$l",
	"charleshearts10.7": "Good. And if you ever need anything, I mean *anything*, I'm here for you, yeah?",
	
// QUESTS 
	"handwrittenhello.dbda_EverbloomQuest.title": "The Everbloom",
	"handwrittenhello.dbda_EverbloomQuest.text": "Charles has given you a rare magic seed. He wants to know if a farmer of your skill can produce a flower from it to surprise Edwin.",
	"handwrittenhello.dbda_EverbloomQuest.objective": "Cultivate and harvest an Everbloom flower, then bring it to Edwin.",
	"handwrittenhello.dbda_EverbloomQuest.reaction": "Where on Earth did you get this? It must have taken ages to grow. Thank you, @.",
	
	"handwrittenhello.dbda_CatchAngie.title": "A Glimmer in the Deep",
	"handwrittenhello.dbda_CatchAngie.text": "There are strange lights in the water near the lighthouse. Try to reel in whatever it might be.",
	"handwrittenhello.dbda_CatchAngie.objective": "Catch the strange fish near the lighthouse.",
	"handwrittenhello.dbda_CatchAngie.reaction": "That's the biggest angler fish I've seen in all my years of fishing!#$b#You say her name is Angie?#$b#Whatever floats your boat. Here's the reward.",
	
	"handwrittenhello.dbda_CrystalCactusQuest.title": "A Prickly Subject",
	"handwrittenhello.dbda_CrystalCactusQuest.text": "Edwin has requested you bring him cactus seeds, though he didn't say what they were for.",
	"handwrittenhello.dbda_CrystalCactusQuest.objective": "Acquire cactus seeds, then bring them to Edwin.",
	"handwrittenhello.dbda_CrystalCactusQuest.reaction": "You received my letter!#$b#Thank you, @. These will do nicely.#$action AddMail Current CactusGottenFlag received",
	
	"handwrittenhello.dbda_SeanceInvitationQuest.title": "The Seance",
	"handwrittenhello.dbda_SeanceInvitationQuest.text": "You've been invited to a seance in the graveyard to find out the secret behind the mysterious ghost.",
	"handwrittenhello.dbda_SeanceInvitationQuest.objective": "Attend the seance in the graveyard after 8pm.",

	"handwrittenhello.dbda_SeanceIngredients1.title": "Spell Ingredients: Void Essence",
	"handwrittenhello.dbda_SeanceIngredients1.text": "The Dead Boy Detectives need ingredients for a spell to strengthen their connection to the strange ghost in the graveyard.",
	"handwrittenhello.dbda_SeanceIngredients1.objective": "Collect and deliver 10 Void Essence to Edwin.",
	"handwrittenhello.dbda_SeanceIngredients1.reaction": "Excellent work, @. This void essence will help anchor the ghost to this plane during the ritual.",
	
	"handwrittenhello.dbda_SeanceIngredients2.title": "Spell Ingredients: Ghostfish",
	"handwrittenhello.dbda_SeanceIngredients2.text": "The Dead Boy Detectives need ingredients for a spell to strengthen their connection to the strange ghost in the graveyard.",
	"handwrittenhello.dbda_SeanceIngredients2.objective": "Catch and deliver a ghostfish to Charles.",
	"handwrittenhello.dbda_SeanceIngredients2.reaction": "Nice work! It's a little gross, but we can use the ghostfish's slime to paint runes that'll protect us during the ritual.",
	
	"handwrittenhello.dbda_SeanceIngredients3.title": "Spell Ingredients: Poppy",
	"handwrittenhello.dbda_SeanceIngredients3.text": "The Dead Boy Detectives need ingredients for a spell to strengthen their connection to the strange ghost in the graveyard.",
	"handwrittenhello.dbda_SeanceIngredients3.objective": "Harvest and deliver a poppy to Crystal.",
	"handwrittenhello.dbda_SeanceIngredients3.reaction": "Thanks, @. Apparently poppy seeds are useful for magic that affects other planes, like the Dreaming.#$b#Or at least I think that's what Edwin said. It was a little difficult to tell past all the ego.",
	
	"handwrittenhello.dbda_CuringNiko.title": "A Strengthening Ritual",
	"handwrittenhello.dbda_CuringNiko.text": "Now that the spell ingredients have been collected, the Dead Boy Detectives are ready to perform their ritual to solve the case of the mysterious ghost.",
	"handwrittenhello.dbda_CuringNiko.objective": "Attend another seance in the graveyard after 8pm.",
	
// ITEMS
	"CharlesAmulet.DisplayName": "Charles' Amulet",
	"CharlesAmulet.Description": "Increases attack power and speed.",
	"CrystalRing.DisplayName": "Crystal Ring",
	"CrystalRing.Description": "Increases stamina and immunity.",
	"DandelionSpriteJar.DisplayName": "Sprite Jar",
	"DandelionSpriteJar.Description": "Home to two very angry dandelion sprites. Their vocabulary sure is colorful.",
	"EverbloomSeed.DisplayName": "Everbloom Seed",
	"EverbloomSeed.Description": "A magical, very rare seed. Blooms once a year.",
	"EverbloomFlower.DisplayName": "Everbloom",
	"EverbloomFlower.Description": "According to ancient texts, only one of these extremely rare blooms can exist at a time. Very powerful as a potion ingredient or for trade among the supernatural community.",
	"SquidEgg.DisplayName": "Glowing Egg",
	"SquidEgg.Description": "A glowing green egg. Hatches into a magical glowing squid when placed in an incubator.",
	"Magic8Ball.DisplayName": "Magic 8 Ball",
	"Magic8Ball.Description": "It just keeps saying 'Outlook not so good'.",
	"Angie.DisplayName": "Angie",
	"Angie.Description": "A terrifying sea monster who usually sticks to the depths. What is she doing so close to the surface?",
	"CrystalTree.DisplayName": "Purple Sapling",
	"CrystalTree.Description": "A potted sapling that almost seems to glow.",
	"RecordPlayer.DisplayName": "Record Player",
	"RecordPlayer.Description": "A vintage record player from around 1989.",
	
// BUFFS
	"Buffs.crystalRing.DisplayName": "Crystal Ring",
	"Buffs.crystalRing.Description": "Increases immunity and regenerates health.",
	"Buffs.CrystalVoidRegen.DisplayName": "Crystal's Void",
	"Buffs.CrystalVoidRegen.Description": "The calmness of Crystal's void fills you.",
	"Buffs.edwin_defense.DisplayName": "Spell of Protection",
	"Buffs.edwin_defense.Description": "Edwin's way of keeping you safe.",
	"Buffs.charles_attack.DisplayName": "Charles' Gift",
	"Buffs.charles_attack.Description": "Charles' enchanted amulet gives you a bonus to your attacks.",

// FARM ANIMALS
	"FarmAnimals.handwrittenhello.dbda_Squid.DisplayName": "Magic Squid",
	"FarmAnimals.handwrittenhello.dbda_Squid.BirthText": "Your glowing egg has hatched.",
	
// MAIL
	"Mail.handwrittenhello.dbda_EdwinProtectionSpellInvite.title": "Edwin's Invitation",
	"Mail.handwrittenhello.dbda_EdwinProtectionSpellInvite.text": "Dear @,^^I would like to extend an invitation for you to visit the agency at your earliest convenience.^You are of course always welcome, but there's something I've been working on that I'd like to show you.^^Your friend,^    Edwin",
	
	"Mail.handwrittenhello.dbda_CharlesAmuletInvite.title": "Charles' Gift",
	"Mail.handwrittenhello.dbda_CharlesAmuletInvite.text": "Hey @,^^You've been such a good friend lately, and I want to repay the favor.^^Meet me at the agency--I've got a surprise I think you'll like. :)^^    -Charles",
	
	"Mail.handwrittenhello.dbda_GiveEverbloomQuest.title": "The Everbloom",
	"Mail.handwrittenhello.dbda_GiveEverbloomQuest.text": "@,^I found this old seed we got as payment probably thirty years ago. The bloke who gave it to us said the blossom might make for a good spell ingredient.^^You've got way more of a green thumb than me, so I was wondering if you would try and grow one? I'd like to surprise Edwin with it.^^Thanks, mate!",
	
	"Mail.handwrittenhello.dbda_CatchAngie.title": "Sea Monsters",
	"Mail.handwrittenhello.dbda_CatchAngie.text": "@,^I've been seeing strange lights in the water down by the lighthouse. When I was a young lad they told tales of sea monsters... Why don't you see if there's anything worth catching down there?^	-Willy",
	
	"Mail.handwrittenhello.dbda_TM_NewStock.title": "New Stock at Tragic Mick's",
	"Mail.handwrittenhello.dbda_TM_NewStock.text": "@,^^I've got some new stock you might like. Good stuff. Those ghost boys dropped it off. Come down and take a look if you've got the time.^^    - Mick",
	
	"Mail.handwrittenhello.dbda_SeanceInvitation1.title": "The Seance",
	"Mail.handwrittenhello.dbda_SeanceInvitation1.text": "Hey @,^^Remember Crystal's vision? Edwin thinks he's figured it out. We're holding a seance tonight in the graveyard--you should come!^^-Charles^^-P.S. Bring a weapon just in case.",
	
	"Mail.handwrittenhello.dbda_SeanceIngredients.title": "Seance Spell Ingredients",
	"Mail.handwrittenhello.dbda_SeanceIngredients.text": "Dear @,^^I have gathered a list of items we shall need for the spell to strengthen our mysterious ghost's connection to this plane. If you would like to help, please bring Charles, Crystal and I the following ingredients at your earliest convenience:^^- Ghostfish (1)^- Poppy (1)^- Void Essence (10)^^With thanks,^	Edwin",
	
	"Mail.handwrittenhello.dbda_NikoCured.title": "Niko's Introduction",
	"Mail.handwrittenhello.dbda_NikoCured.text": "You participated in a seance and anchored Niko's connection to the valley.",
	
	"Mail.handwrittenhello.dbda_CactusGottenFlag.title": "CactusGottenFlag",
	"Mail.handwrittenhello.dbda_CactusGottenFlag.text": "You gave cactus seeds to Edwin.",
	
	"Mail.handwrittenhello.dbda_CrystalCactus.title": "Cactus Seeds for Edwin",
	"Mail.handwrittenhello.dbda_CrystalCactus.text": "Dear @,^^I am in need of cactus seeds. I have been told you know where to acquire some. Would you mind terribly bringing me some? It's for something important.^^Regards,^    Edwin",

	"Mail.handwrittenhello.dbda_CrystalSapling.title": "Crystal's Sapling",
	"Mail.handwrittenhello.dbda_CrystalSapling.text": "Hey @,^^I've got something I want to show you. Touch your hand to the sapling in my room and you'll see. Don't freak out, okay?^^    - Crystal",
	
	"Mail.handwrittenhello.dbda_NikoHandMirror.title": "Niko's Gift",
	"Mail.handwrittenhello.dbda_NikoHandMirror.text": "Dear @,^^I want to thank you for being such a good friend. Whenever you have time, come to my room. I've got a present for you! ;)^^Love,^    Niko",
	
// MAPS
	"WorldMap.Lighthouse.ScrollText": "Point No Point Lighthouse",
	"WorldMap.TragicMicks.ScrollText": "Tragic Mick's",
	
	"LocationDisplayName.DBDA.DisplayName": "Dead Boy Detective Agency",
	"LocationDisplayName.TragicMicks.DisplayName": "Tragic Mick's",
	"LocationDisplayName.Lighthouse.DisplayName": "Point No Point Lighthouse",
	"LocationDisplayName.CharlesBackpack.DisplayName": "Charles' Bag",
	"LocationDisplayName.TNT.DisplayName": "Tongue and Tail Butcher Shop",
	"LocationDisplayName.CNRooms.DisplayName": "Crystal and Niko's Rooms",
	"LocationDisplayName.CrystalVoid.DisplayName": "Crystal's Void",
	"LocationDisplayName.TNTRoof.DisplayName": "Tongue and Tail Roof",
	"LocationDisplayName.Town.DisplayName": "Town",
	"LocationDisplayName.Docks.DisplayName": "Docks",
}