{
"Changes": [
	{
        "LogName": "CharlesDialogue",
        "Action": "EditData",
        "Target": "Characters/Dialogue/CharlesRowland",
		"Entries": {
			"Introduction": "I'm Niko! Thanks for helping my friends. It's great to meet you!",
			"cc_Begin": "",
			"cc_Boulder": "",
			"cc_Bus": "I heard we can take the bus to Calico Desert now!",
			"cc_Minecart": "I heard you fixed the minecarts.#$b#Now you can get around as fast as Edwin, Charles and I can mirror travel!",
			"cc_Complete": "The new community center looks so good!",
			"movieTheater": "Ooh, I hope the movie theater gets Japanese films. Or Scooby Doo.",
			"firstVisit_Mine": "You went down into the mines? I don't know if I'd be brave enough to do that...",
			"GreenRainFinished": "That green rain was so weird. Do you think magic had anything to do with it?",
			
			"MovieInvite_Invited": "I'd love to see a movie with you!$h",
			"DumpsterDiveComment": "@, don't you think that's a little gross?#$b#Wait, are you doing it for a case?",
			//"FlowerDance_Accept_Spouse": "",
			"FlowerDance_Accept": "I'd love to dance with you!$h",
			"FlowerDance_Decline": "No thank you. I don't really like the attention...",
			"AcceptGift_(O)StardropTea": "Ooh, I love this!",
			"divorced": "Are you just here to break my heart again?$s",
			
			// GENERIC DIALOGUE
			"Mon": "The valley is so pretty today.", 
			"Tue": "Being a farmer looks like such hard work.",
			"Wed": "Pelican Town is so small. It's nice. Sometimes I get overwhelmed.",
			"Thu": "I like visiting Mick. He's got all sorts of stories if you take the time to listen.",
			"Fri": "Do you like mysteries? I saw a trailer for a new movie coming out that looked really good.",
			"Sat": "The library is my fourth favorite public building to visit.$h",
			"Sun": "Your farm is soooooo cute!$h",

			"Mon2": "Should I get a job? JojaMart is hiring, and I could use the money...", 
			"Tue2": "I used to own more dolls, but they really freak Edwin out. Now I have stuffed animals instead.",
			"Wed2": "%pet is soooo cute! Say hi for me?#$b#The closest thing I've ever had to a pet was the dandelion sprites... but they were really mean.#$b#And also I could never let them out of their jar or else they would try to possess me again.#$e#It's a long story...",
			"Thu2": "Hi @! Have you harvested anything good lately?",
			"Fri2": "Hi @! I like your shirt. Is it new?",
			"Sat2": "I like taking walks in Cindersap Forest. I stay away from dandelions, though. Last time I wandered into a patch of them I ended up being possessed by a pair of dandelion sprites, who are *not* as cute as they sound. ",
			"Sun2": "I can't wait for fall. I love it when the leaves change color and the weather gets chilly.",

			"Mon4": "I'm so tired today. I was up too late reading last night, but I just had to finish the chapter!", 
			"Tue4": "What's Gus serving for lunch tomorrow?#$e#Ever since coming back, sometimes food tastes like dust. Edwin says it's a ghost thing.",
			"Wed4": "Have the boys ever told you about the time Charles got possessed by a hellhound?",
			"Thu4": "You should grow more tea on your farm. I bet you could come up with some really interesting blends.",
			"Fri4": "I've got to get to the library soon. The newest installment of My Demon Lover just came out!#$b#The last one ended on such a bad cliffhanger...",
			"Sat4": "Charles has been showing me all sorts of cool things ghosts can do! I'm not very good at any of it yet, though.",
			"Sun4": "Edwin came over last night to watch scary movies, but I think he was only pretending to be scared.#$e#That's okay, I was plenty scared enough for both of us.",

			"Mon6": "Maybe I should go back to school like Crystal. It might be hard to register, though...#$b#Being only mostly-alive is hard.",
			"Tue6": "Last week I tried to mirror travel to %farm, but I ended up in Zuzu City. It took forever to figure out how to get back!",
			"Wed6": "I baked some cookies earlier! Although I couldn't taste the dough very well.#$b#You have to try them and tell me if they're good!#$action AddItem (O)223 1",
			"Thu6": "You always look so busy, @. I hope you give yourself time to relax sometimes!",
			"Fri6": "Sometimes I think Charles is way sadder than he pretends to be. I wish he knew it's okay to be sad sometimes.",
			"Sat6": "I think I'll visit the library later. I'm running out of reading material, unless I want to reread my manga collection for the third time.",
			"Sun6": "Do you ever have time to write letters? We could be penpals!",

			"Mon8": "I'm glad Crystal has her memories back. She's worried she's a bad person, but if you ask me, she's the same as always.",
			"Tue8": "I wonder if Crystal will be free to hang out later. We could go to the beach!#$b#Would you like to come?",
			"Wed8": "What's your favorite food you grow on your farm? I have some recipes I've been wanting to try. ",
			"Thu8": "I've never gone fishing. My dad always said he was going to take me, but then he died.",
			"Fri8": "Sometimes it's hard to make myself leave my room. Crystal really helped with that when I met her, though.",
			"Sat8": "Can I tell you a secret?#$e#I've never kissed anyone before.",
			"Sun8": "If you ever want to borrow some of my manga, just let me know.#$b#I'll pick ones I think you'd like!",

			"Mon10": "I should write to my mom... She lives all the way in Osaka. It's hard to find the words for what to write, though.",
			"Tue10": "It's been really nice helping the boys out with their cases again. Just like old times!",
			"Wed10": "Sometimes I have nightmares of Esther's house... Don't tell anyone else, please.$s",
			"Thu10": "If Edwin corrects you, that means he likes you. He also likes being right, but it means more when he takes the time to teach you something.",
			"Fri10": "I think it's neat that Crystal can read minds. Sometimes I wish I had that power.#$e#Then I could tell if someone is just pretending to be nice.",
			"Sat10": "Do you ever miss your old life? Sometimes I do, but I like this one way more.",
			"Sun10": "Roses are my favorite flower. Especially red ones! They're so romantic.",
			
			// Festivals and Events
			"spring_1": "I can't wait for the cherry trees to bloom. They're so pretty.",
			"summer_1": "It's too hot out. I think I might just stay inside today...",
			"fall_1": "I'm so happy it's finally fall.",
			"winter_1": "Winter is here! It's Edwin's birthday today, if you didn't know.",
			"spring_12": "Are you going to participate in the egg hunt tomorrow?",
			"summer_10": "I hope the potluck soup tastes good tomorrow.#$b#Or at least I hope that if it does taste bad, I can't taste it.",
			"summer_27": "Summer is ending, which means the moonlight jellies will visit soon.#$b#I hope I can spot a pink one this year.",
			"fall_15": "The petting zoo is my favorite part of the fair tomorrow.#$b#Marnie's animals are so adorable.", 
			"fall_26": "Do you have a costume for Spirit's Eve?#$e#I thought it would be funny to wear a sheet and go as a ghost, but I didn't want to wreck any of mine by cutting holes in them.#$b#Plus none of them are actually white, they all have cute designs on them.",
			"winter_24": "I love the holidays. In Osaka, my family and I always celebrated the new year by playing games before eating osechi.",
			}	
		}
	]
}