{
	// REGULAR DIALOGUE 
	"CatKing.Introduction": "So you're the new farmer, huh? Word of advice: don't mess with my cats.",
	"CatKing.cc_Begin": "You smell like magic. What have you been getting into, kitten?",
	"CatKing.cc_Boulder": "My cats have been crazy about all the metal in the water lately. Was that your doing?",
	"CatKing.cc_Bridge": "The quarry is open? That would be a good place for a nap in the sun...",
	"CatKing.cc_Bus": "Heard the bus is back up and running. Those folks in the desert know how to treat a cat.",
	"CatKing.cc_Minecart": "Ugh, those minecarts keep me up all day with their screeching. Why would you ever ride one when you could just use magic?",
	"CatKing.MovieInvite_Invited": "",
	"CatKing.DumpsterDiveComment": "Even my strays have better standards than digging in the garbage.",
	//"CatKing.SpouseStardrop": "",
	//"CatKing.FlowerDance_Accept_Spouse": "",
	"CatKing.FlowerDance_Accept": "You want to dance? Only if you can keep up.$h",
	"CatKing.FlowerDance_Decline": "I'm a hot commodity around here. And you're... not so hot.",
	"CatKing.GreenRain": "Rain is bad enough, let alone whatever the fuck this is.#$b#Ugh, I miss the old days before global warming.",
	"CatKing.GreenRain_2": "Rain is bad enough, let alone whatever the fuck this is.#$b#Ugh, I miss the old days before global warming.",
	"CatKing.GreenRainFinished": "Thank god that's over. Meatball's fur started to grow moss after he went out yesterday.",
	"CatKing.AcceptGift(O)StardropTea": "Oh, sweetheart, you shouldn't have! I could kiss you!",
	"CatKing.firstVisit_Mine": "You're clearing out the mines? What, with that dinky little knife?#$b#More than one way to skin a cat, I guess.",
	"CatKing.eventSeen_Seance2": "I heard you helped bring that girl back from the other side... what was her name? Niko?#$b#Guess you're not half-bad at this magic stuff.",
	
	"CatKing.Mon": "There's a stray dog that's been sniffing around the docks lately. My cats chased him right out.",
	"CatKing.Tue": "What do you want? I'm terrifically busy with my ennui.",
	"CatKing.Wed": "If you want something, you'll need to make me happy. I don't do favors... not without something in return.",
	"CatKing.Thu": "Perfect day for a nap... *Yawn*",
	"CatKing.Fri": "Would it kill you to bow or something? I am a cat *king*, after all.#$e#What's a cat king? All of the cats in Pelican Town answer to me, and I provide for them in return.",
	"CatKing.Sat": "Unless you have an offering for me, shoo. I'm too busy to help solve your problems today.",
	"CatKing.Sun": "Looking this good isn't effortless. And sweetheart, I think you could use a little more effort.",
	
	"CatKing.Mon2": "If you mess with the cats under my protection, you'll meet my claws.#$b#And I don't mean that metaphorically.",
	"CatKing.Tue2": "Do you need something? It's like you're obsessed with me.",
	"CatKing.Wed2": "That old wizard's alright. As friendly neighborhood sorcerers go, you could do worse. Much, much worse...",
	"CatKing.Thu2": "Perfect day for a nap... *Yawn*",
	"CatKing.Fri2": "You adopted a pet?#$b#You'd better treat %petname with the care they deserve, or I'll hear about it.|Ugh, of course %petname is a dog... typical.",
	"CatKing.Sat2": "Being a farmer sounds like so much work, ugh. I'd rather jump in the ocean, and you know what they say about cats and water.",
	"CatKing.Sun2": "Have you seen Meatball lately? Gray tabby?#$b#No? Ugh. He's probably fallen down a hole again.",
	
	"CatKing.Mon6": "Ugh, I hope it doesn't rain. I hate getting wet.",
	"CatKing.Tue6": "Have you had the misfortune of meeting Esther yet?#$b#She's almost as old as me, and no matter how many youth potions she brews, she'll never have my looks.",
	"CatKing.Wed6": "You would not *believe* what I have to do to look this good.#$b#What, are you jealous?",
	"CatKing.Thu6": "Perfect day for a nap... *Yawn*",
	"CatKing.Fri6": "I'm trying to sweet talk that silver fox on the docks into a deal. I got cats to feed.",
	"CatKing.Sat6": "Edwin came to me the other day asking for help with a case.#$b#He's so obsessed with me.",
	"CatKing.Sun6": "Edwin thinks he's *so* impressive with his magic. If he would let me teach him some spells, then he could be a real magician.",
	
	"CatKing.Mon8": "This is my kingdom, and yet nobody respects me. Why do I even bother?",
	"CatKing.Tue8": "Hey, ${handsome^beautiful^good-looking}. Caught any good fish lately?",
	"CatKing.Wed8": "Maybe I'll drop by the saloon today. Gus makes a mean baked fish.",
	"CatKing.Thu8": "I can't believe you spend so much time in the forest. I hate trees.",
	"CatKing.Fri8": "Why are there so many nosy teens running around this place? I miss the days when the only ones who needed my attention were my cats.",
	"CatKing.Sat8": "I'd stay away from the swamp if I were you. You don't want to cross a witch, not if you value your life. Or your sanity.",
	"CatKing.Sun8": "Do you think I could get Edwin's attention if I dangled a case in front of him? A nice distraction, and then he'll be grateful...#$b#Sorry, what were you saying?",
	
	"CatKing.Mon10": "Ever think about growing catnip on that farm of yours? I may know a buyer or two.",
	"CatKing.Tue10": "Hey, ${handsome^beautiful^good-looking}. Caught any good fish lately?",
	"CatKing.Wed8": "Maybe I'll drop by the saloon today. Gus makes a mean baked fish.",
	"CatKing.Thu10": "If you're looking for help with learning magic, don't come to me.#$b#What I have can't be taught--natural talent.",
	"CatKing.Fri10": "Ugh, I hope it doesn't rain. I hate getting wet.",
	"CatKing.Sat10": "I'm only on my fourth life, but I want to spend the rest of them with you.",
	"CatKing.Sun10": "You are so oddly fascinating.",
	
	"CatKing.spring_1": "Thank god it's getting warm again. Fur is nice, but even that's not enough to keep out the cold sometimes.",
	"CatKing.summer_1": "The only sensible thing to do in this heat is take a nap.",
	"CatKing.fall_1": "The supernatural world will start rearing its head soon. Ugh.",
	"CatKing.winter_1": "The cats hate getting their paws wet in the snow, and I can't blame them. It's fucking freezing.",
	"CatKing.spring_23": "The Flower Dance? In the old days humans used to celebrate the fertility of spring, instead of whatever twee bullshit that is.",
	"CatKing.summer_10": "There won't be any stew leftover after the luau--my cats will take care of it.",
	"CatKing.summer_27": "There's plenty of magic left in the world.#$b#The moonlight jellies are one of the few things left that humans can naturally experience, though.",
	"CatKing.fall_15": "I heard there's gonna be a petting zoo at the fair tomorrow.#$b#If anyone tried that with my cats I'd put them in a cage--see how they like it.",
	"CatKing.fall_26": "I won't be at the festival tomorrow--the veil is thin, and I need to keep things locked down at the cannery.",
	"CatKing.winter_7": "Say, if you have any spare fish after the festival tomorrow, would you drop by? I'm sure we could work out a deal.",
	"CatKing.winter_24": "Another year gone... they really start to run together after a few hundred of them.",
	
	// STRINGS
	
	
	// GIFT TASTES
	"CatKing.love": "Oh, I could just *kiss* you, @!",
	"CatKing.like": "Are you trying to impress me? Because it's working.",
	"CatKing.dislike": "And what am I supposed to do with this?",
	"CatKing.hate": "Ew. Are you serious?",
	"CatKing.neutral": "It'll do. But don't expect any favors from me, sweetheart.",
}