{
	// REGULAR DIALOGUE
	"crystal_dialogue.Introduction": "Nice to meet you! I'm Crystal. I moved here recently for, um, work.#$e#Wait... you can see ghosts too? Oh, thank god.#$b#Yeah, me, Charles, and Edwin--they're the local overly co-dependent teenage ghosts, if you haven't met them yet--decided to open up a branch of the detective agency here.",
	"crystal_dialogue.cc_Begin": "I heard you have a whole quest to rejuvenate the community center and everything.#$b#Just between you and me, I think that wizard guy is kind of unhinged.$6",
	"crystal_dialogue.cc_Boulder": "I saw a bunch of shiny rocks in the river the other night.#$b#My parents used to have a lake house and I would spend hours panning for gold on the shore. Never found anything, though.",
	"crystal_dialogue.cc_Bus": "We can finally visit other towns? Good, I was feeling a little cooped up here.$h",
	"crystal_dialogue.cc_Minecart": "Sure, can't get a decent phone signal out here, but somehow you got a whole minecart system working. Good job, I guess.",
	"crystal_dialogue.cc_Complete": "The community center looks a lot nicer now. Charles and Edwin might be pissed about the increased foot traffic below them, though.",
	"crystal_dialogue.movieTheater": "I'm so busy I don't know when I'll ever have time, but it's nice to know we can go to the movies now.",
	"crystal_dialogue.firstVisit_Mine": "You look rough. You haven't been visiting those mines alone, have you?",
	"crystal_dialogue.GreenRainFinished": "That green rain was absolutely crazy. Are we sure it wasn't, like, poisonous?$6",
	"crystal_dialogue.MovieInvite_Invited": "I'd love to go to the movies with you.$h",
	"crystal_dialogue.DumpsterDiveComment": "I can't really judge, but when they found me dumpster diving, it was because I was possessed by a demon. Just saying.$6",
	"crystal_dialogue.FlowerDance_Accept_Spouse": "",
	"crystal_dialogue.FlowerDance_Accept": "I'd love to!$h",
	"crystal_dialogue.FlowerDance_Decline": "Umm, maybe next year.",
	"crystal_dialogue.divorced": "God, can't you just leave me alone?",
	"crystal_dialogue.eventSeen_handwrittenhello.dbda_Seance2": "Having Niko back is like... well, I never even thought it was possible.#$b#I can't ever pay you back, so... thank you.",
	
	"crystal_dialogue.Mon": "Winter is my favorite season. The valley is so still and quiet.",
	"crystal_dialogue.Tue": "Last night's episode of Murder After Dark was so crazy. Have you seen it yet?",
	"crystal_dialogue.Wed": "It's really great that you can see ghosts too. It gets a little old, having to pretend like I'm not talking to thin air.",
	"crystal_dialogue.Thu": "I have class all day on Tuesdays and Thursdays. Skipping a bunch of school really sucks when you have to make it up later.",
	"crystal_dialogue.Fri": "You moved here from the city? Do you miss anything about it?#$b#Sometimes I miss the nightlife, but also, that's not really me anymore.",
	"crystal_dialogue.Sat": "I can't wait until the weather is nice enough for sunbathing and swimming.",
	"crystal_dialogue.Sun": "The good thing about Pelican Town is that people don't really look at me too weirdly for talking to ghosts. I guess they're used to things being a little strange around here.",
	
	"crystal_dialogue.Mon2": "Ugh, I stayed up *way* too late last night helping the boys with our current case.",
	"crystal_dialogue.Tue2": "You haven't seen any medieval-looking ghost girls, have you? We're working on a case right now and she was a witness.",
	"crystal_dialogue.Wed2": "I think Abigail has a crush on Sebastian.#$b#Sorry, I'm trying to gossip less, but old habits...",
	"crystal_dialogue.Thu2": "I have class all day on Thursdays. Skipping a bunch of school really sucks when you have to make it up later.$2",
	"crystal_dialogue.Fri2": "It's a good thing the town is so small, because I never learned how to drive, and I can't mirror hop like the boys.",
	"crystal_dialogue.Sat2": "Thank God it's Saturday. I need a day to myself.",
	"crystal_dialogue.Sun2": "I don't think I've ever lived in such a small town before.#$b#Well, there was that one time my parents tried becoming hermits for a month as part of their latest performance art piece, but I don't think that counts.$6",
	
	"crystal_dialogue.Mon4": "The other teens haven't really invited me to hang out yet. Maybe it's because I'm still new to the valley...$s#$e#I hope it's not because they think I'm crazy.$6",
	"crystal_dialogue.Tue4": "I don't know whether to be relieved or concerned that my parents haven't called in weeks.$s#$b#Maybe they lost my number...",
	"crystal_dialogue.Wed4": "Did you know that over 200,000 murders have gone unsolved in the last four decades? And so many of the victims never move on...",
	"crystal_dialogue.Thu4": "$q Q_Navy_response1/Q_Navy_response2 Q_Navy_fallback#You don't know anything about 20th century naval battles, do you? I swear this class is going to kill me.$6
		#$r Q_Navy_response1 0 Q_Navy_reaction1#Uh, what?
		#$r Q_Navy_response2 10 Q_Navy_reaction2#Yes, actually... [give a detailed lecture about 20th century naval battles]",
	"crystal_dialogue.Q_Navy_reaction1": "Yeah, not surprising. Like, when am I ever gonna need to know this stuff?$6#$b#Thanks, though.",
	"crystal_dialogue.Q_Navy_reaction2": "Wow, I can't believe you just knew all that. You're a lifesaver!$h",
	"crystal_dialogue.Q_Navy_fallback": "Thanks again for your help with this assignment.$h",
	"crystal_dialogue.Fri4": "%pet is so cute. I wish I had a pet, but there's no way Jenny would let me lease.",
	"crystal_dialogue.Sat4": "Have you been exploring the mines? Charles says the lower levels are like, totally infested with poltergeists.",
	"crystal_dialogue.Sun4": "Hey, @. You wouldn't happen to know anything about the local mermaids, would you? Charles says we might have to talk to them about our case.",
	
	"crystal_dialogue.Mon6": "I've been wondering if I should learn how to cook. Gus makes great food and all, but when he's closed and I get home at 3am I'd like to not burn down the kitchen trying to make noodles.",
	"crystal_dialogue.Tue6": "Jenny would probably be happy to buy any fish you catch off you. Apparently most people here are pescatarian.",
	"crystal_dialogue.Wed6": "If Charles ever asks you to hold something while he digs in his bag, be careful.#$b#One time he handed me a sack full of goat hearts like it was nothing. So gross...$6",
	"crystal_dialogue.Thu6": "Juggling the agency and online classes can be a lot, but we're helping people, so it's worth it. ",
	"crystal_dialogue.Fri6": "When it gets too loud in my head, I like to visit the spa. It's quiet there.",
	"crystal_dialogue.Sat6": "I don't have much luck when it comes to growing plants like you. You should see the state of the tree I'm supposed to be taking care of.",
	"crystal_dialogue.Sun6": "How are things on the farm going? It must be a lot of work.",
	
	"crystal_dialogue.Mon8": "The other ghosts around town say that your farm should be, like, crazy haunted for how old it is. You haven't noticed anything strange, have you?",
	"crystal_dialogue.Tue8": "Do you have any tips for what to do when a tree looks like it's wilting?#$b#Like, if the tree was metaphorical. Kind of. #$b#Never mind.",
	"crystal_dialogue.Wed8": "I accidentally read Lewis' mind the other day when he handed me something.#$b#I did *not* need to know what he and Marnie get up to.",
	"crystal_dialogue.Thu8": "I've been thinking about studying law after I graduate. There has to be some accountability for the living, because the dead only have us.",
	"crystal_dialogue.Fri8": "If you see Edwin, can you tell him to get his ass over to my place?#$b#I think there are pixies in my vents again.",
	"crystal_dialogue.Sat8": "Hey, if Edwin ever gives you any grief about hanging around like an unwanted stray, tell me? He pulled that shit when I first met them too.",
	"crystal_dialogue.Sun8": "Being a psychic isn't everything it's cracked up to be.#$e#Sometimes I almost wish I could turn my brain off.",
	
	"crystal_dialogue.Mon10": "Do you want to go to the saloon sometime? Gus has pretty good milkshakes.$l",
	"crystal_dialogue.Tue10": "You should come over for movie night sometime. We won't even have to share popcorn with the boys.#$b#Just don't be surprised if Edwin guesses the ending, though...",
	"crystal_dialogue.Wed10": "I'm really glad I met you, @. I feel way less alone.$h",
	"crystal_dialogue.Thu10": "I don't really feel the need to go clubbing like I used to, but I do miss the dancing sometimes. Do you dance?$l",
	"crystal_dialogue.Fri10": "It's really great everything you've done for the town. I try to help people out, but I never feel like I can make up for what I've done in the past.",
	"crystal_dialogue.Sat10": "I had the weirdest dream last night. You were in it... Never mind.",
	"crystal_dialogue.Sun10": "The boys do care, a lot, it's just... sometimes they forget what it's like to be alive.#$e#Maybe in thirty years stupid teenage bullshit won't matter, but it feels like it does now, you know?",
	
	"crystal_dialogue.summer_1": "It's getting so hot out. I could use a day at the beach to cool off.#$b#Or at least somewhere with air conditioning.",
	"crystal_dialogue.fall_1": "Things are about to start getting busy in the spirit world.",
	"crystal_dialogue.winter_1": "All this cold, wet weather reminds me of London.",
	"crystal_dialogue.spring_12": "Are you excited for the flower dance? Kind of a weird, outdated holiday, but I guess it has its perks.",
	"crystal_dialogue.summer_10": "What should I bring to the potluck? I can't cook for shit.",
	"crystal_dialogue.summer_27": "I know they're not actually magic, but the dance of the moonlight jellies sure does feel like it.",
	"crystal_dialogue.fall_15": "I don't remember the last time I went to the fair before moving here. I must have been little.",
	"crystal_dialogue.fall_26": "I don't have a costume for the festival tomorrow...$s#$e#Things have been so busy at the agency I feel like I've spent all month running around.",
	"crystal_dialogue.winter_7": "Ice fishing isn't really my thing, but I bet you'd be great at it.",
	"crystal_dialogue.winter_24": "I'm so excited for the Winter Star feast tomorrow.#$b#I wonder who drew my name in the gift exchange.",
	
	// STRINGS 
	"crystal_strings.Meditation.000": "%Crystal is deep in a trance.",
	"crystal_strings.WokenUpTrance.000": "I can see it all...$u#$b#Sorry, @, how long have you been standing there?",
	"crystal_strings.SplishySplashy.000": "Hey, @. Want to dip your feet in?",
	"crystal_strings.Cellphone.000": "I can only get a few bars here. I wonder if Edwin has a spell for boosting my connection.",
	"crystal_strings.Reading.000": "Wow, could these old farts write anything more confusing? What the hell does 'myftical noftrum for all beaftly ills' even mean?$6",
	"crystal_strings.Reading.001": "Huh, did you know that ghosts who have died in graveyards can become trapped there for eternity?$6",
	"crystal_strings.Reading.002": "Ugh, this is giving me a headache.$s",
	"crystal_strings.NightMarket.000": "That guy in the robe keeps looking over at us...$6#$e#Do you think he can see ghosts?",
	
	// GIFT TASTES
	"CrystalPalace.love": "Wow, @, I don't even know what to say. Thank you!",
	"CrystalPalace.like": "Thanks. You didn't have to do this.",
	"CrystalPalace.dislike": "This is, uh... are you sure?",
	"CrystalPalace.hate": "What the fuck, @?",
	"CrystalPalace.neutral": "Thanks, @.",
}