{
// AGENCY
	// edwin 2 hearts - potion gone wrong
	"edwinhearts2.0": "Ah, @. You haven't come at the best time.#$b#I'm in the middle of mixing a rather delicate potion.#$b#I suppose you can stay, if you'd like to watch.",
	"edwinhearts2.1": "If I have followed the instructions correctly, then this potion will allow us ghosts to temporarily consume food and drink for the duration.$u#$b#I must admit, seeing the kinds of crops you grow on your farm has tempted even me.",
	"edwinhearts2.2": "That's strange.#$b#This clearly says to add the liverwort after stirring, when I could have sworn...",
	"edwinhearts2.3": "Edwin's potion went wrong.#Laugh at Edwin#Help him clean up",
	"edwinhearts2.4": "This is embarrassing. Thank you, @.$6#$b#$6You weren't too close to the splash, I hope?",
	"edwinhearts2.5": "Good. Now, if you'll excuse me, I should dispose of the remains of this ill-advised experiment before Charles returns.$6",
	
	// charles 2 hearts - sorting the bag
	"charleshearts2.0": "Hey, @. How are things going on the farm?#$b#I'm just sorting through my bag.",
	"charleshearts2.1": "It's been a bit of a mess in there recently, but I think I’ve got some sort of a system going.#$b#I've had to reorganize to fit all the new stuff we’ve got since coming to town.",
	"charleshearts2.2": "Check this out.",
	"charleshearts2.3": "I come in here sometimes when I need to think.#$b#It's good for whenever I need to get away, you know?",
	"charleshearts2.4": "It's safe, don't worry.$h#$b#Come on over.",
	"charleshearts2.5": "Sorry for the mess... I haven't really had anyone in here before.",
	"charleshearts2.6": "Sorry for the mess... I haven't really had anyone in here before.",
	"charleshearts2.7": "Yeah, you should really clean up in here...",
	"charleshearts2.8": "I don't mind.",
	"charleshearts2.9": "Yeah, you're probably right...",
	"charleshearts2.10": "Just wait until you knock over the jar of bees. Speaking from experience, you only make that mistake once.$h",
	"charleshearts2.11": "Anyway, even if I'm not around, feel free to come in here if you need a minute away. Just don't get lost!$h",
	
	// niko 4 hearts - mirror trouble
	"niko_hearts4.0": "Allow me to demonstrate.",
	"niko_hearts4.1": "Ah, @, good morning. Charles and I were just about to teach Niko about some of the so-called 'ghost rules', seeing as she is only partially alive now.#$b#One of the better perks is the ability to mirror travel; observe.",
	"niko_hearts4.2": "'S alright, @, he just popped across to Niko's room. Look.",
	"niko_hearts4.3": "See? Simply concentrate on your destination, and with practice, you will be able to travel quickly and reliably.#$b#And, as you have observed, bring objects through mirrors with you as well.$h",
	"niko_hearts4.4": "I *have* always been jealous of you being able to travel through mirrors.$h",
	"niko_hearts4.5": "There's gotta be *some* perks to being dead.",
	"niko_hearts4.6": "Go ahead, Niko. Try to move from that mirror to the other.",
	"niko_hearts4.7": "Okay... here goes...",
	"niko_hearts4.8": "...#$b#...Niko?$s",
	"niko_hearts4.9": "Bloody hell, where's she gone?$7",
	"niko_hearts4.10": "I knew I should have accompanied her on her first trip. This is my fault.$s",
	"niko_hearts4.11": "It's alright, mate, we'll get her back.$9#$b#@, you stay here in case she finds her own way back.#$b#Edwin, remember when I first started, and I kept getting lost? Let's start by checking the usual haunts, yeah?",
	"niko_hearts4.12": "Yes, I suppose we shall have to start somewhere-",
	"niko_hearts4.13": "Niko! You alright?$7",
	"niko_hearts4.14": "Oh my gosh! I don't know where I ended up, but that was scary!$s",
	"niko_hearts4.15": "I'm sorry, Niko. I should have guided you more on your first attempt.$s",
	"niko_hearts4.16": "It's okay. But if it's alright with you, I think I'd like to be done practicing for now.",
	"niko_hearts4.17": "Of course. Why don't we finish watching that television programme you showed me last week?$h",
	"niko_hearts4.18": "Charles, @, I shall see you later.",
	"niko_hearts4.19": "Bye guys!",
	"niko_hearts4.20": "Phew, glad that's sorted.$h#$b#I was worried for Niko, but for a second there I thought Edwin was going to go spare.$s#$b#Just between you and me, he's been pretty... jumpy, I guess, when it comes to Niko.$s#$b#It's just 'cause he doesn't want to lose her again, yeah?#$b#We'll work on mirror travel another time.#$b#While it's just us, d'you wanna take a look at this new ring we got as payment? It's supposed to make you invisible...$h",
	
	// boys 5 hearts - solving a case
	"edwinhearts5.0": "-and when we consider the fact that she wasn't at home at the time...",
	"edwinhearts5.1": "Ah, @.  Good to see you.$h",
	"edwinhearts5.2": "Maybe you can solve this one for us, mate.$h#$b#Edwin and I have been talking each other 'round in circles all day with this case.",
	"edwinhearts5.3": "A client came to us late last night in tears.#$b#She herself died almost ten years ago in a traffic accident, while her husband survived.",
	"edwinhearts5.4": "She never moved on 'cause she wanted to look after her husband, yeah? You following?",
	"edwinhearts5.5": "As to why she sought our help: her husband has recently gone missing.#$b#He was last seen in their town's graveyard.$u#$b#She reported that there were no signs of a struggle...#$b#...besides a few drops of blood in the dirt, which she admitted could have belonged to a wild animal.",
	"edwinhearts5.6": "Don't forget that people had been hearing weird noises at night the whole week.#$b#Sort of a weird howling, not like any animals they'd heard before.",
	"edwinhearts5.7": "Yes, precisely. However, the unusual thing is that none of the graves were disturbed.",
	"edwinhearts5.8": "Normally with a graveyard abduction you expect to see a necromancer, or a haunting, something like that.",
	"edwinhearts5.9": "Right, so we've tried locator spells, scrying, everything you can think of to find him.#$b#Edwin thinks he was taken by the fae...#$b#...and I reckon it was some sort of hellhound hunting him down, like that's why we can't find him.",
	"edwinhearts5.10": "Well, @? You've heard the details of the case.#$b#What do you think took our client's husband?",
	"edwinhearts5.11": "What do you think took our client's husband?",
	"edwinhearts5.12": "A troupe of fae",
	"edwinhearts5.13": "A hellhound",
	"edwinhearts5.14": "A vampire",
	"edwinhearts5.15": "None of these, he just got lost",
	"edwinhearts5.16": "Just as I suspected.",
	"edwinhearts5.17": "Ah, you believe Charles' theory.",
	"edwinhearts5.18": "We hadn't even considered that. Very astute, @.",
	"edwinhearts5.19": "I suppose it's possible... though not very common, in our line of work.",
	"edwinhearts5.20": "Thank you, @. You've been surprisingly helpful.#$b#We shall take your analysis into account.",
	"edwinhearts5.21": "Hey, keep it up, and you might even become a junior member of the agency!$h",
	
	// edwin 10 hearts - spell of protection
	"edwinhearts10.0": "Hello, @. You got my message, I presume?",
	"edwinhearts10.1": "Since we've grown closer, I've been...#$b#...Well, I've been realizing some things.#$b#Your friendship means a great deal to me.",
	"edwinhearts10.2": "I never anticipated growing so attached to anyone when Charles and I came to Pelican Town, but you have embedded yourself quite firmly in my heart.",
	"edwinhearts10.3": "Where is that spellbook...#$b#Ah, here it is. Charles must have done some reorganizing when fiddling with his bag of tricks.",
	"edwinhearts10.4": "@, I... I find I cannot bear the thought of you getting hurt, and being unable to stop it.#$b#I know your adventures can be dangerous, and it would put my mind at ease to know that I have made you at least a bit safer.",
	"edwinhearts10.5": "Would you allow me to cast a spell of protection on you?#$b#It should lessen any damage you take.#$b#I've also modified it with my own flair to improve your luck.",
	"edwinhearts10.6": "Excellent. This shall only take a tick.",
	"edwinhearts10.7": "That should do it.$h#$b#Thank you, @.",
	
	// monty 7.2 hearts - convincing edwin
	"montyhearts7.2.0": "Monty? What are you and @ doing here?",
	"montyhearts7.2.1": "I know this is a big favor to ask, but... I need your help.$s",
	"montyhearts7.2.2": "You have a case for us?#$b#Let me get Charles.",
	"montyhearts7.2.3": "No, not a case, exactly.#$b#Do you remember, um, what the Cat King said? In the forest?",
	"montyhearts7.2.4": "Are you referring to when he revealed your allegiance with the witch who was trying to end Charles' and my existence? Of course.$a",
	"montyhearts7.2.5": "I'm really sorry about all of that...$s#$b#I wanted to apologize to you but I couldn't put it into words when I tried to write it down, and you didn't seem interested in talking again...$s#$b#She's my witch, and I'm her familiar, and I literally *can't* disobey her.$s#$b#At first it was just a job, getting close to you to trick you, but then I realized I actually liked you.$s#$b#I tried to convince Esther to let her grudge go, but it was too late.$s",
	"montyhearts7.2.6": "Yes, I... I confess I may have been avoiding you.$s#$b#I do appreciate the apology, and I regret the situation you were put in by Esther Finch.$s",
	"montyhearts7.2.7": "Thanks, Edwin.#$b#So will you help me and @?",
	"montyhearts7.2.8": "That depends entirely on what you need help with. It is not a case, as you said, so I deduce it must be related to your troubles with Esther.$u#$b#I shouldn't like to cross her again, so I do hope you don't intend me to join in any violent or retributive actions.",
	"montyhearts7.2.9": "No, I wouldn't put you in danger from her... Not again, I mean.$s#$b#She transformed me so that I turn back into a crow every night as soon as the sun sets.$s#$b#There's a ritual we can perform to make me human, and since you're the best at magic, I figured it would be safer with you there to perform it.",
	"montyhearts7.2.10": "I see. And I assume this ritual is quite dangerous?#$b#@, what is your opinion in all this?",
	"montyhearts7.2.11": "We really need your help. Monty's right, it would be safer with you there.",
	"montyhearts7.2.12": "You don't owe Monty anything, especially after he betrayed you. I didn't know the full story until now.",
	"montyhearts7.2.13": "Actually, I think this whole thing is a bad idea. I changed my mind.",
	"montyhearts7.2.14": "I see... I apologize, Monty, but I must agree with @.$s#$b#I do sympathize with your plight, but I cannot put myself nor Charles at risk of reprisal from Esther.$s#$b#Best of luck with your attempts.",
	
	"ConvincedEdwin.0": "Very well then. I shall do some research to prepare.",
	"ConvincedEdwin.1": "Thank you so much! Meet me and @ at Esther's house when you're ready.$l",
	
	"CallTheWholeThingOff.0": "@! You promised you'd help!$a",
	"CallTheWholeThingOff.1": "I see... I apologize, Monty, but I must agree with @.$s#$b#This is a dangerous proposal, and we cannot get involved.$s",
	"CallTheWholeThingOff.2": "Fine. Some friends you guys are.$a#$b#I'll do it myself.$a",
	
// BEACH
	// cat king 5 hearts - lying to willy
	"catkinghearts5.0": "Oh! Hello there, moggy. Did you wander over from that abandoned cannery?$h",
	"catkinghearts5.1": "Hehe... Why don't you stick around, and I'll see if I can rustle up some tuna.$h",
	"catkinghearts5.2": "@! What are you doing here?$s",
	"catkinghearts5.3": "Just here for a little fishing.",
	"catkinghearts5.4": "Does Willy know you're not a random stray?",
	"catkinghearts5.5": "If you tell him, I will personally make sure you find hairballs in your food for the rest of your life.$a",
	"catkinghearts5.6": "Your secret's safe with me.",
	"catkinghearts5.7": "It's weird that you're pretending to be a normal cat. You should tell Willy the truth.",
	"catkinghearts5.8": "Thanks, @. I knew I could count on you.$h#$b#Listen, I better scram before he gets back. Talk to you later!",
	"catkinghearts5.9": "I knew you wouldn't understand.$a",
	"catkinghearts5.10": "${Son?^Lass?^@?}$#$b#Where did that stray go?#$b#Oh well. More fish for me!$h#$b#Are you here to listen to another of my legendary fishin' tales?",
	
	"quickEscape.0": "Great, have fun. I have to go.$s",
	"quickEscape.1": "${Son?^Lass?^@?}$#$b#Where did that stray go?#$b#Oh well. More fish for me!$h#$b#Are you here to listen to another of my legendary fishin' tales?",
	
// CANNERY
	// cat king 2 hearts - comes on way too strong
	"catkinghearts2.0": "So I hear you've been making waves in town, huh?#$b#Cozying up to everyone?#$b#Don't think I haven't noticed your efforts at wooing little old me, either.",
	"catkinghearts2.1": "You don't have to play coy, @. I know you want me.",
	"catkinghearts2.2": "Ew, creep. Leave me alone.",
	"catkinghearts2.3": "You're right... I'm madly in love with you.",
	"catkinghearts2.4": "Way to send mixed signals.$a#$b#I wouldn't want to be tied down to you anyway.$u#$b#Leave me alone if you just came here to bother me.$u",
	"catkinghearts2.5": "What, are you scared? Come on, sweetheart, I don't bite.$u",
	"catkinghearts2.6": "Okay, I don't normally say this, but that's moving a little fast, even for me.$s#$b#If you weren't up for a little bit of fun, you should have just said. I don't like being played, and I definitely don't like being led on.$a",
	"catkinghearts2.7": "Sorry... Let's just be friends.",
	"catkinghearts2.8": "I like you, but I don't want something casual.",
	"catkinghearts2.9": "You're coming on way too strong, and I'd like to leave.",
	"catkinghearts2.10": "Whatever.$u#$b#If that's all you came here to say, you can go now. I have very important matters to attend to.$u",
	"catkinghearts2.11": "Sorry, sweetheart, but I don't really do that whole 'committment' thing.$u#$b#Anyway, if you just came here to profess your undying love for me, you can go now. I have very important matters to attend to.$u",
	"catkinghearts2.12": "Fine, I get it.$s#$b#I love ${a boy^a girl^someone}$ who can set a boundary.#$b#Anyway, now that we've had that nice little chat, you can leave. I have very important matters to attend to.$u",
	
	// cat king 7.2 hearts - urging him to stop hiding
	"catkinghearts7.2.0": "@? What are you doing here so late?$8#$b#I was taking a much-needed nap, but if you came here for some fun, I could be convinced.$9",
	"catkinghearts7.2.1": "I told everyone you were the stray cat that's been begging for attention.",
	"catkinghearts7.2.2": "The people in town want to get to know you.",
	"catkinghearts7.2.3": "And? Am I supposed to care?$8",
	"catkinghearts7.2.4": "Okay, okay!$13#$b#Look, it's just... it's something you wouldn't understand.$10#$b#You've been unbelievably persistent in trying to befriend me, God knows why, but this is out of your wheelhouse, okay?$10",
	"catkinghearts7.2.5": "God, you're annoying. FINE.$13",
	"catkinghearts7.2.6": "Do you know how long I've lived?$a#$b#I'm on my fourth life. I remember this land before Pelican Town was even founded.$s#$b#That's a lot of time to spend missing people you've lost...$s#$b#At some point I decided I was done with it all. No more friends, no more long-term relationships that would end in heartbreak.$s#$b#I didn't realize until you came along, but... I was lonely.$s",
	"catkinghearts7.2.7": "Do you really think I need to make other friends?$s",
	"catkinghearts7.2.8": "Okay... I'll do it. For you.$h",
	"catkinghearts7.2.9": "Not tonight, though. It's late, and I need my beauty sleep.#$b#...Good night, @.$l",
	
	"toldTownspeople.0": "WHAT?!$13",
	"toldTownspeople.1": "How could you? I'll be lucky if I'm not chased out of town!$a",
	"toldTownspeople.2": "#Nobody would do that.#I'm sorry, but I thought they needed to know.",
	"toldTownspeople.3": "...I guess you're right.$s#$b#It's just...$s",
	"toldTownspeople.4": "Do you know how long I've lived?$s#$b#I'm on my fourth life. I remember this land before Pelican Town was even founded.$s#$b#That's a lot of time to spend missing people you've lost...$s#$b#At some point I decided I was done with it all. No more friends, no more long-term relationships that would end in heartbreak.$s#$b#I didn't realize until you came along, but... I was lonely.$s",
	"toldTownspeople.5": "Do you really think I need to make other friends?$s",
	"toldTownspeople.6": "Okay... I'll do it. For you.$h",
	"toldTownspeople.7": "Not tonight, though. It's late, and I need my beauty sleep.#$b#...Good night, @.$l",
	
// CRYSTAL/NIKO ROOMS
	// niko quest begin
	"Niko1.0": "I do not see why you find this so difficult, Crystal. You were able to defeat that forest elemental we encountered quite handily.",
	"Niko1.1": "Don't be so hard on her, mate. Not exactly a life-and-death situation, is it?",
	"Niko1.2": "Perhaps we ought to make it one, then, to ensure expediency...$3",
	"Niko1.3": "I'm sorry, when did you become a psychic again?$6#$b#Oh, you're not? Then be quiet and let me think.$6",
	"Niko1.4": "Oh, hey, @. We're just helping Crystal practice.#$b#Edwin thought he saw something odd in the graveyard the other day, so she's gonna try and read it.",
	"Niko1.5": "I think I see something...$u",
	"Niko1.6": "I can feel something... sad.$u",
	"Niko1.7": "It's... it's lonely, whatever it is. I can't tell...$u",
	"Niko1.8": "It's another ghost, but... wrong, somehow.$u",
	"Niko1.9": "Well, that sounds like a case for us, don't it?$h",
	"Niko1.10": "Quite. We shall need to prepare.#$b#@, you may as well come along on this case, if you wish.#$b#You can expect a letter from us shortly with further instructions.",
	
	// niko 2 hearts - mad libs
	"niko_hearts2.0": "Oh, hi, @!#$b#I was just writing. I'm a little stuck on this part, though.$a#$b#Actually, maybe you could help? You have really good ideas!",
	"niko_hearts2.1": "Okay, so where do you think the scene should take place?",
	"niko_hearts2.2": "Pick a place.",
	"niko_hearts2.3": "Oh, interesting, okay. What do you think the characters should see there?",
	"niko_hearts2.4": "They should encounter a...",
	"niko_hearts2.5": "I never would have thought of that!#$b#Thanks, @. I think I only need one more thing...",
	"niko_hearts2.6": "It's supposed to be a romance, but I don't know what would spark the two of them getting together.#$b#How do you think it should happen?",
	"niko_hearts2.7": "How did Niko's characters fall in love?",
	"niko_hearts2.20": "They",
	"niko_hearts2.16": "together until sunset.",
	"niko_hearts2.17": "together all day.",
	"niko_hearts2.18": "every night",
	"niko_hearts2.19": "their home.",
	"niko_hearts2.8": "Oh, that's so romantic!$l#$b#I know exactly what to write now. Thanks so much, @.",
	"niko_hearts2.9": "As soon as I'm done, do you want to read it?",
	"niko_hearts2.10": "Will you read Niko's story when she's done?",
	"niko_hearts2.11": "Yes",
	"niko_hearts2.12": "No",
	"niko_hearts2.13": "Great! I'll let you know when it's finished.$h",
	"niko_hearts2.14": "Oh... that's okay, you don't have to.$s",
	"niko_hearts2.15": "Thanks again for the help, @. See you later!",
	
	// niko 6 hearts - baking cookies
	"nikohearts6.0": "Hi @!#$b#I actually have a surprise for you, but you're a little early.$h",
	"nikohearts6.1": "Here. I made cookies! You're always so sweet, so I wanted to make something sweet for you.$h",
	"nikohearts6.2": "Well? How do they taste?",
	"nikohearts6.3": "Oh no...$s#$b#I used a recipe and everything, but I couldn't taste any of the ingredients!$s",
	"nikohearts6.4": "Most of the time food just tastes like sand to me now. Edwin and Charles said that's how it is for ghosts all the time, but I hate it!$s#$b#How am I supposed to bake for my friends, or go out to eat with them, or have any of the food you grow on your farm?$s",
	"nikohearts6.5": "I'm glad that you guys brought me back, but sometimes it really sucks.$s",
	"nikohearts6.6": "It's okay, the cookies weren't that bad.",
	"nikohearts6.7": "Maybe you can't always taste the food, but you can still share the experiences with people.",
	"nikohearts6.8": "You should be glad you can't taste your horrible attempts at baking.",
	"nikohearts6.9": "You're just trying to make me feel better.$s#$b#But thank you, I guess.",
	"nikohearts6.10": "I guess you're right... Charles and Edwin still have fun whenever Crystal eats in front of them.#$b#And I can still smell and touch things, so maybe I could just imagine being able to taste things.",
	"nikohearts6.11": "Sorry I screwed the cookies up so bad. You probably hate me.$s",
	"nikohearts6.12": "Anyway, I'll just have to keep practicing.#$b#I'll make you the best cookies ever, even if it takes a hundred batches!",
	
	// niko 10 hearts - giving you mirror
	"nikohearts10.0": "@! You got my letter?$h",
	"nikohearts10.1": "You know, ever since moving to the valley...#$b#It's been really hard trying to adjust. Not just to what I am now, partly alive and partly dead...#$b#But all these new people, new places, well...#$b#Sometimes it's enough to make me want to stay in my room for days on end.#$b#It's a lot easier to pretend that I'm not scared that way.",
	"nikohearts10.2": "But you've made it a lot easier for me to put myself out there. You're always so nice, and encouraging, and I see how hard you work to make the town a better place.$l#$b#Which is why I wanted to give you this...",
	"nikohearts10.3": "I'm still trying to get the hang of mirror traveling, but maybe this will help you get around a little easier!#$b#It's enchanted to teleport you to my room. That way we can hang out more!$h",
	
	// crystal 1 heart - sad about niko
	"crystalhearts1.0": "*sighhhh*...$s#$b#Do you ever think about death?$s",
	"crystalhearts1.1": "Like, what happens when we move on. Obviously some people don't, like Charles and Edwin...$s#$b#...And I'm glad they get a second chance, because they didn't deserve to die so young. Like, what a shitty hand to get dealt.$s#$b#But... I had a friend...$s#$b#She didn't get a second chance.$s",
	"crystalhearts1.2": "She's in a better place.",
	"crystalhearts1.3": "Nothing happens when we move on. We just cease to exist.",
	"crystalhearts1.4": "I'm sorry. She was lucky to have a friend like you.",
	"crystalhearts1.5": "Yeah... I'd like to think so.$s",
	"crystalhearts1.6": "That's so depressing... but probably true. I don't know.$s",
	"crystalhearts1.7": "That's nice of you to say.$s#$b#I'm not so sure, though...$s",
	"crystalhearts1.8": "It was my fault she died. The spell was coming straight for me, but Niko...$s#$b#She jumped right in front of it. There wasn't even time to think.$s",
	"crystalhearts1.9": "This used to be hers.$s",
	"crystalhearts1.10": "You can have it. It brings back too many memories.$s#$b#I'll see you later.$s",
	
	// crystal 7 hearts - edwin gifts cactus
	"crystalCactus.0": "Crystal? Are you decent?$7#$b#I would not want a repeat of last April's Topless Incident...$7",
	"crystalCactus.1": "That was entirely your fault for not warning me before you hopped through my mirror.$6#$b#But yes, you can come in.",
	"crystalCactus.2": "I have something for you. @ assisted me in procuring it.$h",
	"crystalCactus.3": "Now if you'll excuse me, I must return to the office.#$b#Charles seemed quite determined in trying to pull a rabbit out of the magic hat we received as payment last week, and I'm anxious to see the results of his efforts.$s",
	"crystalCactus.4": "Oh, hey, @. You just missed Edwin.",
	"crystalCactus.5": "He just gave me this cactus...$7#$b#He got the seeds from you, I guess? That's cool.$7",
	"crystalCactus.6": "I wonder why a cactus, though.$7",
	"crystalCactus.7": "I wonder why a cactus, though.#He thinks it's prickly and needs a lot of attention, just like you.#He thinks it's resilient, just like you.",
	"crystalCactus.8": "You think? That's really sappy, even for him.$6",
	"crystalCactus.9": "But thank you.$h#$b#If you see him before I do, tell him to come over?#$b#If he thinks he can get away with a handshake instead of a hug after this, he's insane.$h",
	"crystalCactus.10": "Hey, while you're here, mind giving me some tips?#$b#You've got way more of a green thumb than me, and I don't want to kill this poor cactus.",
	"crystalCactus.11": "You gave Crystal some tips on how to care for her new cactus.",
	
	"CrystalCactusMean.0": "What's that supposed to mean?$a",
	"CrystalCactusMean.1": "I think you should go. Since I'm so terrible to be around.$a",

// CRYSTAL VOID
	// crystal 10 hearts - showing you void
	"crystalhearts10.0": "@! You made it.$h",
	"crystalhearts10.1": "Where are we?",
	"crystalhearts10.2": "This is awesome!",
	"crystalhearts10.3": "This is scary...",
	"crystalhearts10.4": "We haven't actually gone anywhere.#$b#Or at least, our bodies haven't.#$b#You know how I'm a psychic? I brought you into my mind.",
	"crystalhearts10.5": "Thanks!$l#$b#It's pretty incredible, isn't it? It's a representation of my mind.#$b#Don't worry, we haven't actually gone anywhere--it's just a projection.",
	"crystalhearts10.6": "Don't be afraid! It's totally safe.#$b#This is just a manifestation of my psychic powers.#$b#I'll put you back safe and sound, don't worry.",
	"crystalhearts10.7": "This tree... It represents me, and the connection I have to all my ancestors.",
	"crystalhearts10.8": "It's my responsibility to take care of it, but I haven't been doing a great job of it...$s",
	"crystalhearts10.9": "But you know what? I'm really proud of myself.#$b#It feels weird to say, especially when a lot of things in my life have been really fucked up, but I am.#$b#A lot of it was my fault. Remember how I told you I used to be such a shitty human being?",
	"crystalhearts10.10": "The guilt was eating me alive.#$b#It turns out that even for a psychic--maybe *especially* for a psychic--it's really hard to get out of your own head.$3#$b#What helps is thinking about my friends, and you've been a big part of that.#$b#I see the way you run around helping people. It reminds me to focus on doing good here, now, instead of dwelling on the past.",
	"crystalhearts10.11": "To thank you, and as a reminder from me to you about doing good, I wanted to give you this.",
	"crystalhearts10.12": "And feel free to come here whenever you need a break. Maybe we could hang out in here together sometime?$l",
	
// FARM
	// joja route warning
	"JojaRouteWarning.0": "Hey, @.#$b#So I guess you've heard by now, but they started work on the old community center last night. Turned it into a warehouse, apparently.$s",
	"JojaRouteWarning.1": "It'll make things difficult for us, but there's nowhere else to move the agency to, so we've just got to carry on, yeah?$s#$b#Edwin's pretty angry, though... thought I should warn you.$s#$b#He'll get over it eventually... I hope.$s#$b#Just thought I should let you know.",
	"JojaRouteWarning.2": "Oh, and... we also heard there were plans to maybe turn it into a movie theatre. You heard anything about that?",
	"JojaRouteWarning.3": "#No#Yes",
	"JojaRouteWarning.4": "Right... well, if that happened, we'd probably have to leave.$s#$b#You might not see us around town as much, 'cause it's not like Crystal would want us staying with her again.$s#$b#Just something to think about, yeah?",
	"JojaRouteWarning.5": "Anyway, see you around.",
	
	// monty 7.1 hearts - beg for help with ritual
	"montyhearts7.1.0": "Hi, @. Sorry, I know it's kind of early...#$b#I have a favor to ask you.",
	"montyhearts7.1.1": "I tried to keep it a secret, but Esther made sure that didn't work.$s#$b#It's true... I'm actually a crow. She lets me transform during the day so that I can help her with her insane plans, but I'm sick of being used.$s#$b#I don't want to be under her thumb anymore. I want to be able to live my own life, but as a human, not as a crow.",
	"montyhearts7.1.2": "There's a spell that could make me human, permanently. But it needs three people.#$b#Will you help me?",
	"montyhearts7.1.3": "Will you help me?",
	"montyhearts7.1.4": "Of course I'll help.",
	"montyhearts7.1.5": "No, find someone else.",
	"montyhearts7.1.6": "Who else are you getting to help?",
	
	"helpMontyEasy.0": "Thank you so much. You have no idea how much this means to me.",
	"helpMontyEasy.1": "Who else are you getting to help us?",
	"helpMontyEasy.2": "How do I help you?",
	
	"ritualDetails.0": "I'll take care of everything. I'll send you a letter when I'm done getting the spell ready, so just wait for that.#$b#Thank you so much, again.",
	
	"noHelpMonty.0": "Oh... okay. Forget I asked.$s#$b#Sorry to bother you. I'll go now.$s",
	
	"whoHelpMonty.0": "I don't know if he'll agree, but... Edwin is the best spellcaster I know.#$b#If anything goes wrong, he should be there.",
	"whoHelpMonty.1": "I don't want to help you.",
	"whoHelpMonty.2": "Okay. How do I help?",
	"whoHelpMonty.3": "Why wouldn't he help?",
	
	"MontyEdwinBackstory.0": "It's kind of a long story, but... remember how I mentioned that Esther used me?$s#$b#She made me trick Edwin, manipulate him, so that she could take revenge on him and Charles after they crossed her.$s#$b#He was the angriest I've ever seen him.$s",
	"MontyEdwinBackstory.1": "If he won't help, well... I don't know what I'll do.$s",
	"MontyEdwinBackstory.2": "Actually, this is a bad idea. I don't want to help you.",
	"MontyEdwinBackstory.3": "I'll help you convince Edwin.",
	"MontyEdwinBackstory.4": "If Edwin won't help, I still will. What should I do?",
	
	"helpConvinceEdwin.0": "Really? That's so nice of you.$h#$b#Meet me at the agency later.",
	"helpConvinceEdwin.1": "I'll go start getting things ready. See you!",	

// FINCH ATTIC
	// switchEvent from monty 7.3 hearts - with edwin
	"EdwinStopsInterruption.0": "Wait, @!$s#$b#I know it's difficult to see Monty in pain...$s",
	"EdwinStopsInterruption.1": "The spell is almost complete. Monty will pull through.$s#$b#Quickly, use the dragon tooth!",
	"EdwinStopsInterruption.2": "I feel...$s#$b#I feel great!$l",
	"EdwinStopsInterruption.3": "The ritual was a success!$h",
	"EdwinStopsInterruption.4": "Thank you guys so, so much!$l#$b#I have to... I have to go tell everyone!$l",
	"EdwinStopsInterruption.5": "I know I can't possibly repay you, but anything you want, @, I'll give it to you, seriously.#$l",
	
	// switchEvent from monty 7.3 hearts - no edwin
	"interruptRitual.0": "Monty...?",
	"interruptRitual.1": "@! You almost ruined everything!$a#$b#I trusted you to help... why couldn't you trust me to know my own limits?$a",
	"interruptRitual.2": "I'm sorry... I should have listened to you.",
	"interruptRitual.3": "I did the right thing. You were in too much pain.",
	"interruptRitual.4": "Thank you for the apology... I'm glad it worked out in the end.$s#$b#I do feel lighter already...#$b#...I think the ritual worked!$h",
	"interruptRitual.5": "Even now you're too stubborn to see the damage you could have done.$a#$b#Whatever. The ritual worked, no thanks to you, so you can go now.$a",

// FINCH HOUSE
	// monty 4 hearts - crow discovery, esther taunt
	"montyhearts4.0": "There's no sign of Monty... where is he?",
	"montyhearts4.1": "CAW!$6",
	"montyhearts4.2": "How did you get in here, you nosy little shit?$a#$b#Did Monty tell you that you could come over? $a#$b#Lovestruck little fool.$l",
	"montyhearts4.3": "You poor thing. You don't even know the secrets he keeps, do you?$u#$b#Wondering where he is? He's right behind you.$s",
	"montyhearts4.4": "He's a crow, honey. You didn't know? Oops.$h",
	"montyhearts4.5": "My sweet crow familiar.#$b#Too bad the little fool keeps falling in love with anyone who gives him the time of day.$u#$b#Oh well, he'll learn his lesson soon enough.$u",
	"montyhearts4.6": "Now scram, kid. You're trespassing.$a",
	
	// monty 7.3 hearts - with edwin
	"montyhearts7.3_edwin.0": "Well... Here goes nothing.#$b#Edwin is up in the attic already getting things started. Are you sure you don't want to back out?",
	"montyhearts7.3_edwin.1": "Great.$h",
	"montyhearts7.3_edwin.2": "I have finished preparations for the ritual.#$b#Monty, are you sure you wish to proceed? I suspect it will be quite painful.$s",
	"montyhearts7.3_edwin.3": "Yes, I have to do this. I have to be free.$s",
	"montyhearts7.3_edwin.4": "@, I must impress upon you the importance of not interfering with the ritual.$s#$b#Even if Monty is in immense pain, any deviations could lead to things going horribly wrong. It's never wise to interrupt a spell once in progress.$s",
	"montyhearts7.3_edwin.5": "Monty, first you must drink the potion I've prepared. It will allow your form to solidify during the ritual.",
	"montyhearts7.3_edwin.6": "Blegh!$7",
	"montyhearts7.3_edwin.7": "(It is times like these that I do not miss my sense of taste.)#$b#@, you must hold the dragon's tooth above your head on my signal.#$b#I shall begin the spell now.",
	"montyhearts7.3_edwin.8": "Edwin begins to read aloud from his spellbook.",
	"montyhearts7.3_edwin.9": "Ugh... it feels like my bones are melting!$7#$b#No, don't stop!$s",
	"montyhearts7.3_edwin.10": "[Stop the ritual.]",
	"montyhearts7.3_edwin.11": "[Continue.]",
	"montyhearts7.3_edwin.12": "I know it is difficult to see Monty in pain...$s#$b#It shouldn't disrupt the ritual too much if you were to hold Monty's hand. It's almost over.",
	"montyhearts7.3_edwin.13": "Edwin continues chanting. The smoke is getting thicker.",
	"montyhearts7.3_edwin.14": "AUGH!$7",
	"montyhearts7.3_edwin.15": "Now, @!$7",
	"montyhearts7.3_edwin.16": "I feel...$s#$b#I feel great!$l",
	"montyhearts7.3_edwin.17": "The ritual was a success!$h",
	"montyhearts7.3_edwin.18": "Thank you guys so, so much!$l#$b#I have to... I have to go tell everyone!$l",
	"montyhearts7.3_edwin.19": "I know I can't possibly repay you, but anything you want, @, I'll give it to you, seriously.#$l",
	
	// monty 7.3 hearts - no edwin
	"montyhearts7.3_noEdwin.0": "Well... Here goes nothing.#$b#Are you sure you don't want to back out?",
	"montyhearts7.3_noEdwin.1": "Great.$h",
	"montyhearts7.3_noEdwin.2": "I got everything ready... you have the dragon tooth, right?#$b#Good. I'll start the spell, and when I tell you, use the dragon tooth.#$b#Also, no matter how much pain I'm in, you can't stop, okay? I *have* to do this. I have to be free.$s",
	"montyhearts7.3_noEdwin.3": "Monty begins to chant.",
	"montyhearts7.3_noEdwin.4": "Ugh... it feels like my bones are melting!$7#$b#No, we can't stop!$s",
	"montyhearts7.3_noEdwin.5": "[Stop the ritual.]",
	"montyhearts7.3_noEdwin.6": "[Continue.]",
	"montyhearts7.3_noEdwin.7": "Monty continues chanting. The smoke is getting thicker.",
	"montyhearts7.3_noEdwin.8": "AUGH!$7",
	"montyhearts7.3_noEdwin.9": "Now, @!",
	"montyhearts7.3_noEdwin.10": "I feel...$s#$b#I feel great!$l",
	"montyhearts7.3_noEdwin.11": "The ritual was a success!",
	"montyhearts7.3_noEdwin.12": "Thank you so, so much!$l#$b#I have to... I have to go tell everyone!",
	"montyhearts7.3_noEdwin.13": "I know I can't possibly repay you, but anything you want, @, I'll give it to you, seriously.#$l",

// LIBRARY
	// edwin 7 hearts - apology
	"edwinhearts7.0": "Oh, hello, @. I was just browsing the shelves for any books I haven't read yet.#$b#I don't suppose you have any recommendations?",
	"edwinhearts7.1": "What book would you recommend to Edwin?#Murder at Magnolia Mansion#My Life as a Teenage Werewolf#1001 Curses and Cures",
	"edwinhearts7.2": "Fascinating. I shall give it a try.",
	"edwinhearts7.3": "I'm glad we ran into each other, as it happens.#$b#This is... difficult for me to say, but...$s#$b#I apologize. I treated you quite rudely upon our first acquaintance... and for some time thereafter.$s",
	"edwinhearts7.4": "I'm glad in the end that you have remained steadfast in your attempts to become friends.$h",
	"edwinhearts7.5": "Can you forgive me for acting so coldly toward you?$2",
	"edwinhearts7.6": "Can you forgive me for acting so coldly to you?#Yes#No",
	"edwinhearts7.7": "I'm relieved.$h#$b#And here - will you accept this book as a token of apology from me?$h",
	
	"notForgive.0": "I suppose that's fair.#$b#Please accept my further apology for having asked.$s",

// LIGHTHOUSE
	// charles 7 hearts - traumadumping 
	"charleshearts7.0": "*sniff*... Hey, @.",
	"charleshearts7.1": "Sorry, I'm not really good company right now...#Sorry, I'll leave you alone.#That's okay. Can I stand here with you for a bit?",
	"charleshearts7.2": "Yeah, sure. *sniff*.$s",
	"charleshearts7.3": "Do you ever feel like you just can't do things right some days?$s",
	"charleshearts7.4": "Sorry, that was kind of heavy.$s#$b#I just mean, like... it's rough, sometimes, being dead and all.$s#$b#I usually don't mind, not really, because I've got Edwin and I've got the agency and that's all good, you know?#$b#But then I remember how my mates chased me into that lake, or how my dad used to hit me...$s",
	"charleshearts7.5": "Sometimes it's like he's still around, yelling in my ear about how I'm gonna mess this up too.$s#$b#And if I mess up, like, that's it, it's over, you know?...$s#$b#I'd lose Edwin, I'd lose *everything*.$s",
	"charleshearts7.6": "You should focus on the positive things about the present.",
	"charleshearts7.7": "You should try to forget the past.",
	"charleshearts7.8": "It's okay to feel sad sometimes.",
	"charleshearts7.9": "Yeah, you're right. I know I shouldn't worry so much about this sort of thing...",
	"charleshearts7.10": "Yeah, you're right. I know I shouldn't worry so much about this sort of thing...",
	"charleshearts7.11": "Yeah... you sound just like Crystal. I promise I'm trying, alright?",
	"charleshearts7.12": "And it helps making friends like you, don't it?$h#$b#Thanks for listening, @.",
	
// LOST AND FOUND DEPARTMENT
	"NightNurseDebrief.0": "Alright there, @?$9",
	"NightNurseDebrief.1": "Mirror travel can be rough, especially if you're not used to it.$9",
	"NightNurseDebrief.2": "Ahem.",
	"NightNurseDebrief.3": "Have you got a door ready, then?$9",
	"NightNurseDebrief.4": "I really must impress on the both of you how dangerous this is.#$b#To walk willingly into Hell... and with one of you a mortal being, no less!",
	"NightNurseDebrief.5": "I'll be fine. I've done dangerous things before.",
	"NightNurseDebrief.6": "It doesn't matter; Edwin needs our help.",
	"NightNurseDebrief.7": "Do you really need me to go with you, Charles?",
	"NightNurseDebrief.8": "Your silly little escapades in the local caves are nothing compared to the psychological and physical torment of Hell.#$b#But if I cannot stop you...",
	"NightNurseDebrief.9": "Oh, the folly of youth...#$b#You know hardly anything about what you are about to walk into, and yet I suspect it will make no difference in your decision.",
	"NightNurseDebrief.10": "It will be dangerous. I can't ask you to come, and if it were up to me, nobody would ever have to see that place ever again.$9#$b#I've done it alone before, and I'll do it again a thousand times, for Edwin.$9",
	"NightNurseDebrief.11": "Very well. If you are both truly set on this, then follow me.",
	"NightNurseDebrief.12": "The door to Hell is through here.#$b#I shall keep it open while you're gone, but do hurry. The longer it's open, the more danger we are all in.",
	"NightNurseDebrief.13": "I don't have Edwin's map this time, but I remember the way to the Doll House.$9#$b#I'd bet anything that's where that demon is keeping Edwin.$9",
	"NightNurseDebrief.14": "Not so fast, Mr. Rowland. Things have changed since you last had to fetch Mr. Payne.#$b#The hallways of Hell continually shift to confuse all but its native inhabitants.#$b#You may not even be able to locate Mr. Payne, never mind a suitable path through the Doll House, on your first entry.",
	"NightNurseDebrief.15": "Then we'll keep trying until we do. Right, @$9?",
	"NightNurseDebrief.16": "Very well. I hope you're prepared...",
	"NightNurseDebrief.17": "You may now enter the Doll House.",
	"NightNurseDebrief.18": "Spit spot, if you please. I cannot keep the door open forever.",

// SALOON
	// cat king 7.1 hearts - townspeople want to know him
	"catkinghearts7.1.0": "Evening, @!$h#$b#I'll be right with you.",
	"catkinghearts7.1.1": "Can I get you a drink to end the night?",
	"catkinghearts7.1.2": "No thanks.",
	"catkinghearts7.1.3": "Sigh... Always the same thing with him. I don't even know his name!$s#$b#He just comes in, hangs out in the corner, and leaves at the end of the night.$s#$b#I know he's new to town, but I thought he'd get less shy over time!",
	"catkinghearts7.1.4": "@, you know him pretty well, don't you? Do you know why he won't talk to any of us?$s",
	"catkinghearts7.1.5": "He likes to keep to himself.",
	"catkinghearts7.1.6": "It's not my place to say.",
	"catkinghearts7.1.7": "Actually, you all already know him. He's the stray cat that hangs around town sometimes.",
	"catkinghearts7.1.8": "I see... I hope he isn't too lonely.$s#$b#If you get the chance, tell him he's welcome to a chat over a drink anytime!",
	"catkinghearts7.1.9": "I understand.#$b#It might make the townspeople feel less awkward around him if he were to make some friends around town, though.",
	"catkinghearts7.1.10": "That old stray... I knew there was something odd about him!",
	"catkinghearts7.1.11": "I've fed that cat a few times... I never knew he was a cat that turns into a human.#$b#Or is he a human that turns into a cat?$s",
	"catkinghearts7.1.12": "@, I think you ought to have a talk with him. It feels like there are a lot of misunderstandings that could be cleared up...",
	
	// cat king 10 hearts - coming out to the town
	"catkinghearts10.0": "@! And you brought your friend...$h#$b#What's your name, stranger?",
	"catkinghearts10.1": "Uh... you can call me Thomas, I guess.",
	"catkinghearts10.2": "Welcome, Thomas! We're so glad to meet you.$h",
	"catkinghearts10.3": "Now, Thomas, I don't mean to be rude... but was that really you at my door the other day?",
	"catkinghearts10.4": "I'm not angry, son!#$b#Just sorry you never got that tuna I offered ye, haha!$h",
	"catkinghearts10.5": "It... doesn't bother you that I lied to you? All of you?$s",
	"catkinghearts10.6": "I'm sad you thought you needed to, but no harm done, right?#$b#Why didn't you just tell us, though?",
	"catkinghearts10.7": "I guess... it's hard, letting people in.$s#$b#I mean, I didn't even want to pay attention to @, but ${he^she^they}$ bugged me for weeks.#$b#It's ${his^her^their}$ fault I'm even here, actually.",
	"catkinghearts10.8": "@, you made me see how lonely I had made myself. I had my cats, of course, but I had hidden myself away in that cannery without even realizing.$s#$b#Even when I made a fool of myself in front of you, you didn't stop trying to befriend me.#$b#And now you've introduced me to everyone.$h#$b#So... not to be disgustingly sappy, but thank you.$l",
	"catkinghearts10.9": "I'll drink to that!$h#$b#Come here, Thomas, I'll buy the first round.#$b#Gus, put it on my tab!",
	
// SEEDSHOP
	// crystal 4 hearts - hayley is a bitch
	"crystalhearts4.0": "Oh, hi. You're... Crystal, right? Pretty name.",
	"crystalhearts4.1": "Kind of a shame that your face doesn't match...#$b#Come to me if you want a makeover, okay?",
	"crystalhearts4.2": "Sure, if I ever want to learn how to look faker than a Barbie doll, I'll let you know.$a",
	"crystalhearts4.3": "Hmph! I was just trying to help!$a",
	"crystalhearts4.4": "Oh my god, why did I say that? What the hell is wrong with me?$2",
	"crystalhearts4.6": "She deserved it.",
	"crystalhearts4.7": "That was rude. You should apologize.",
	"crystalhearts4.8": "No, she didn't deserve that...$2#$b#She just reminded me of who I don't want to be anymore.$2",
	"crystalhearts4.9": "Yeah, you're right...$2#$b#She just reminded me of who I don't want to be anymore.",
	"crystalhearts4.10": "It's a really long story, but basically, I lost all my memories a few months ago...$2#$b#I got them back eventually, but remembering that I used to be actually really shitty to a lot of people?$2#$b#It wasn't fun, let me just say that.$2#$b#I could try and make excuses for it...$s#$b#My parents were never home, I was acting out to get attention, I didn't have good role models...$s#$b#But it doesn't change the fact that I hurt a lot of people for a long time.$s",
	"crystalhearts4.11": "...Do you think I can make it up to Haley?$2",
	"crystalhearts4.12": "Do you think I can make it up to Haley?#You should apologize and take her up on the offer.#You should apologize with a gift.#You should forget about it. Neither of you meant to be rude.#You should explain to her why you reacted like that.#I'm staying out of this.",
	"crystalhearts4.13": "Okay. I'll think about it.",
	"crystalhearts4.14": "Thanks for the advice, @. I should get going.",
	
	// docks rumors
	"DocksTalks.0": "It's farmer {{PlayerName}}!",
	"DocksTalks.1": "Hello, @! I'm checking in with all the local businesses early this week. Did you hear the big news?",
	"DocksTalks.2": "The old docks east of the beach re-opened. They were shut down decades ago when the Pelican Town Port stopped bringing in any revenue.#$b#Without any income, and with municipal funds focused on interior infrastructure, they fell into disrepair and became hazardous to pedestrians.$s#$b#I've been trying to gather the funds to rejuvenate them for years!#$b#But a mysterious benefactor paid for their repair... Someone who only went by the initials 'C.K.'",
	"DocksTalks.3": "I'm hoping that increased traffic will mean more customers seeking out my fresh produce!#$b#After all, what's better than a nice, juicy orange after weeks at sea?",
	"DocksTalks.4": "I think we're all hoping for some new visitors!#$b#Between you and your farm, @, and some new maritime trade, Pelican Town could become a real hidden gem on the map!$h",
	"DocksTalks.5": "I'll probably head down there after I finish up here. If you make it over there before me, why don't you greet our mysterious new resident?",
	"DocksTalks.6": "And tell them to stop by Pierre's for the best groceries Pelican Town has to offer!$h",
	
// TEMP
	// temp - laugh at edwin
	"laughAtEdwin.0": "I don't understand. It should have worked...$6#$b#You've distracted me, @.$6#$b#I don't need your help cleaning this up, so kindly leave me to my embarrassment.$6",
	
// TONGUE AND TAIL
	// monty 10 hearts - moving in with jenny
	"montyhearts10.0": "That should be everything. We're lucky Robin could build an extension onto the shop so quickly.#$b#Now, ground rules: rent is due on the 28th, and for the love of God don't pay it in loose coins.#$b#Second: the shop isn't a hangout spot. I run a business. All teenage drama goes outside or to your room.#$b#Third: don't--",
	"montyhearts10.1": "@! I was gonna invite you over, but you beat me to it.$h#$b#Jenny let me move in. I couldn't spend another minute in that house with Esther.",
	"montyhearts10.2": "Yeah, because apparently I run a house for troubled teens now.#$b#Whatever. You don't seem like as much trouble as the fucking Scooby Gang upstairs, so don't make me regret this.",
	"montyhearts10.3": "Thanks, Jenny!",
	"montyhearts10.4": "Seriously, I wanted to thank you. Without you, I'd still be stuck.#$b#But now I've got a life and a place of my own and...#$b#...a friend.$l",
	"montyhearts10.5": "Monty! I can't believe we're going to be neighbors!$h",
	"montyhearts10.6": "Wow, nice digs. Did Jenny give you The Talk?$h",
	"montyhearts10.7": "Would it kill you two to knock? I'm gonna die of a heart attack some day and it'll be your fault.$a",
	"montyhearts10.8": "You live with ghosts and call yourself a detective. A detective should be prepared for such events.$u#$b#Anyway, we came to congratulate Monty.$h",
	"montyhearts10.9": "Yeah, good job, mate. We're glad to have you around.$h",
	"montyhearts10.10": "Thank @. I wouldn't be here without ${him^her^them}$.#$b#You're all welcome to come over any time.$h",
	"montyhearts10.11": "Why don't we celebrate? Monty, you choose. Movie night or game night?$h",

// TOWN
	// seance 1
	"Seance.0": "Ah, you decided to join us, @.#$b#This could be dangerous, but I am confident in your ability to handle yourself.#$b#You certainly handle that weapon of yours well when adventuring.",
	"Seance.1": "#I was born ready.#Maybe this isn't a good idea...",
	"Seance.2": "Edwin, stop scaring ${him^her^them}$.#$b#It'll be fine, yeah? That's what I've got this for.$u",
	"Seance.3": "Can we hurry up? It's like, freezing out here.#$b#@ and I can still feel the cold, you know.",
	"Seance.4": "Very well. Let us call forth the spirit you saw in your vision.#$b#If you wouldn't mind using your psychic powers to call it as well?",
	"Seance.5": "We call forth the spirit that is haunting the Pelican Town graveyard.#$b#Be you benevolent or restless, confused or lost, come forward.",
	"Seance.6": "We want to help you.#$b#Come on, it's alright.",
	"Seance.7": "It worked!",
	"Seance.8": "Can you hear us?",
	"Seance.9": "The connection is fading...#$b#Quick, Crystal, can you strengthen it with your powers?",
	"Seance.10": "I'm trying, but I can barely feel the ghost.",
	"Seance.11": "Shit! I lost it.",
	"Seance.12": "Can you get it back?$7",
	"Seance.13": "We shall have to strengthen its connection to the physical plane.$u#$b#This will require some research...$u",
	"Seance.14": "Another case for the Dead Boy Detectives!$h#$b#@, Crystal, it's pretty late. Can I walk you home?",
	
	// seance 2
	"Seance2.0": "Is everyone ready?#$b#There may be unexpected consequences to performing the strenghtening ritual. We ought to be on our guard.$u",
	"Seance2.1": "Got my bat ready, mate.$u",
	"Seance2.2": "Let's bring this ghost home.",
	"Seance2.3": "Very well. Let us begin.",
	"Seance2.4": "I am addressing the spirit who haunts the Pelican Town graveyard.#$b#The spell I am currently performing will allow you to anchor yourself to the town so that we may speak.",
	"Seance2.5": "If you reach out, we can help you, yeah?",
	"Seance2.6": "It's working! I can feel that she's stronger now.$u",
	"Seance2.7": "She? Can you ask her who she is?",
	"Seance2.8": "Charles, Crystal, @! I sense that our ritual has attracted unwanted attention!",
	"Seance2.9": "@ and I will hold them off. Crystal, Edwin, keep anchoring the ghost!$9",
	"Seance2.10": "Please! Tell us who you are so we can help you!$u",
	"Seance2.11": "...$u#$b#...Niko?$s#$b#Oh my god, Niko!$h",
	"Seance2.12": "You guys found me!$h",
	"Seance2.13": "Niko? How is this possible?$s#$b#After you died... we ran to escape Death herself at Esther Finch's house...$s#$b#You became a ghost after dying?",
	"Seance2.14": "I wasn't a ghost. I was sort of somewhere in between, I think?$6#$b#Don't worry, I know you guys would never leave me, not on purpose.#$b#I'd really love to tell you the whole story right now, but that ritual was exhausting.$6",
	"Seance2.15": "You're right. We're just happy you're back. The whole story can wait.",
	"Seance2.16": "Thanks, guys.$h#$b#And you made a new friend!$h",
	"Seance2.17": "Did you help bring me back? Thank you!$h",
	"Seance2.18": "Yeah, @ was a huge help. We couldn't have brought you back without ${him^her^them}$!$h#$b#We'd better get you all home, though. It's pretty late.",
	"Seance2.19": "Yes, we shall hear the whole story another day.$u#$b#Top whole job, everyone.$h",
	
	"montyhearts1.0": "Sorry! I didn't see you there, haha. You're the new farmer, @, right?$h#$b#I was just checking out some books about astrology.",
	"montyhearts1.1": "Astrology? You know that stuff is all made up, right?",
	"montyhearts1.2": "Astrology? What's your star sign?",
	"montyhearts1.3": "That's nice.",
	"montyhearts1.4": "So what? It's fun to learn about, and you can't deny that it has some truth to it.$a",
	"montyhearts1.5": "I'm a Pisces!$h",
	"montyhearts1.6": "Yeah, right now I'm reading this book about how your rising sign influences your love life.$l",
	"montyhearts1.7": "Anyway, I have to go. Sorry again for running into you!",
	"montyhearts1.8": "Feathers...?",
	
// TRAGIC MICKS
	// charles 10 hearts - giving you amulet
	"charleshearts10.0": "...but what color do you think ${he'd^she'd^they'd}$ like...?",
	"charleshearts10.1": "Don't ask me, Charles. You're the one who insisted on this gift.",
	"charleshearts10.2": "@! I didn't see you there, haha...$l",
	"charleshearts10.3": "Well I guess now that you're here...",
	"charleshearts10.4": "I was going to surprise you, but... here.",
	"charleshearts10.5": "It's been really aces being your friend.#$b#Ever since we came to Pelican Town, you've made it easier, you know?#$b#You always listen, even when I can't really explain what I'm feeling...#$b#And it's like you always know how to cheer me up. And...#$b#I just thought I'd come here and find something to say thank you.$h#$b#It's an enchanted amulet. Supposed to make you better at fighting or something.",
	"charleshearts10.6": "You like it, then?$l",
	"charleshearts10.7": "Good. And if you ever need anything, I mean *anything*, I'm here for you, yeah?",
}