{
	// egg festival
	"Festivals.EggFestival.CharlesRowland": "The egg hunt always reminds me of the Rotten Egg Debacle of '98. Right, Edwin?$h",
	"Festivals.EggFestival.EdwinPayne": "If Charles and I could participate in the egg hunt, nobody else would stand a chance, frankly.$u",
	"Festivals.EggFestival.CrystalPalace": "I hate hardboiled eggs. The smell reminds me of that poltergeist we dealt with last year.",
	"Festivals.EggFestival.NikoSasaki": "I love the egg festival. It's like the valley comes alive!",
	"Festivals.EggFestival.CatKing": "Ugh, all these kids running around... remind me why I'm wasting my time here, again?",
	"Festivals.EggFestival.EstherFinch": "Hmph. Cute. Quaint. And I can't even get away with snatching one of the kids...$s#$e#Pretend you didn't hear that last part.",
	"Festivals.EggFestival.JennyButcher": "I sold out of stock for this festival. Gus did a good job with the food.",
	"Festivals.EggFestival.MontyFinch": "You'd need a real bird's eye view to find all the eggs in time.",

	// flower dance
	"Festivals.FlowerDance.CharlesRowland": "I taught Edwin how to dance once. For fun, not that posh nonsense from way back when.",
	"Festivals.FlowerDance.EdwinPayne": "This reminds me of the horrid events my parents made me attend as a child. I cannot imagine dancing in front of an audience would be at all enjoyable.$s",
	"Festivals.FlowerDance.CrystalPalace": "I'm more used to the kind of dancing that happens in clubs, not whatever this is.",
	"Festivals.FlowerDance.NikoSasaki": "All the dancers look so pretty... I don't know if I could ever dance, though. I don't like too much attention on me.",
	"Festivals.FlowerDance.MontyFinch": "I wonder if Edwin would want to dance with me?#$e#Probably not...$s",
	"Festivals.FlowerDance.CatKing": "Are you gonna ask me to dance? You better have a pretty sweet offer.",
	"Festivals.FlowerDance.EstherFinch": "The flower dance might as well be older than me, it's so outdated. And I just *look* young and beautiful, honey.$l",

	// luau
	"Festivals.Luau.CharlesRowland": "Just looking at that soup is enough to make me feel sick.$s#$b#I'm glad I don't have to eat it.",
	"Festivals.Luau.EdwinPayne": "Remind me why we are here, again? Surely there are cases we could be working on instead.$s",
	"Festivals.Luau.CrystalPalace": "The soup kind of reminds me of what the housekeeper would throw together whenever I got sick.#$b#That's why I threw in some noodles--I always liked her noodle soup best.",
	"Festivals.Luau.NikoSasaki": "The soup smells soooo good! What are you putting in it?",
	"Festivals.Luau.MontyFinch": "It's really great that the whole town can come together to share the soup.#$b#The only meals I've ever shared were with a giant snake in Esther's basement.#$e#What?",
	"Festivals.Luau.CatKing": "Ugh, all this sand is going to get caught in my fur...#$b#At least I'll have plenty of leftovers to feed the cats.",
	"Festivals.Luau.EstherFinch": "There has to be some kind of magic potential in a communal meal.#$b#Gross, good feelings, ew.", //unused

	// moonlight jellies
	"Festivals.MoonlightJellies.CharlesRowland": "Being out on the water makes me nervous, but it's worth it to see the Moonlight Jellies.",
	"Festivals.MoonlightJellies.EdwinPayne": "Did you know, Pelican Town is the only region in the world home to such unique specimens? Fascinating.$u",
	"Festivals.MoonlightJellies.CrystalPalace1": "I'm so glad Niko is here to see this...",
	"Festivals.MoonlightJellies.CrystalPalace2": "I wish Niko were here to see this...",
	"Festivals.MoonlightJellies.NikoSasaki": "The moonlight jellies are sooooo beautiful! I'd take one home, but they belong in nature.",
	"Festivals.MoonlightJellies.MontyFinch": "I have to make it home before the moon rises... Esther doesn't like it when I'm out at night.", //unused
	"Festivals.MoonlightJellies.CatKing": "You won't catch me out over the water. I'm plenty good back here.",
	"Festivals.MoonlightJellies.EstherFinch": "The jellies, you know, they make a wonderful skin serum. You should try it.$h",

	// fair
	"Festivals.Fair.CharlesRowland": "Have you been to the petting zoo yet? The chickens are pretty cute.$h",
	"Festivals.Fair.EdwinPayne": "Ridiculous. That fortune-teller is nothing compared to Crystal.$u",
	"Festivals.Fair.CrystalPalace": "Wow, did Edwin just compliment me? Is he running a fever?$h",
	"Festivals.Fair.NikoSasaki": "Charles helped me play the strength game. You should have seen everyone's faces when the bar hit maximum!$h",
	"Festivals.Fair.MontyFinch": "Do you think the petting zoo animals ever wish they could fly?",
	"Festivals.Fair.CatKing": "I'm only here to keep an eye on my cats. They love begging for people's scraps at the fair.",
	"Festivals.Fair.EstherFinch": "This whole town should be under my thumb. All this joyful yelling, it's just sickening.$s",
	"Festivals.Fair.JennyButcher": "My dad would have loved this. He was all about these small-town celebrations.",
	
	// day of the dead
	"Festivals.Dead.Abigail": "It's like something straight out of a ghost story, huh?#$e#Not so scary when you actually talk to them, though.",
	"Festivals.Dead.Alex": "Sometimes I wish my mom had stayed so I could talk to her again...$s#$b#I'm glad she moved on, though. She's happier this way.",
	"Festivals.Dead.Caroline": "It's important to make sure the deceased still know that we care about them.#$e#Pelican Town wouldn't be what it is today without them.",
	"Festivals.Dead.Clint": "When I die, I'm definitely not sticking around like these guys.",
	"Festivals.Dead.Demetrius": "This day is such a fascinating scientific pheonomenon!#$b#I'd love to study what makes the deceased visible to us once a year, but it's over too quickly to get any good data.",
	"Festivals.Dead.Elliott": "The departed have such wonderful stories to tell. I only wish they could tell them more often!",
	"Festivals.Dead.Emily": "The Festival of the Beyond is a wonderful opportunity to get in touch with the energy of the other side.",
	"Festivals.Dead.Evelyn": "I remember my first Lifting of the Veil all those decades ago. Some of these spirits have seen me grow up from a little girl!",
	"Festivals.Dead.George": "Hmph. Don't see the point in talking to all these ghosts when I'm gonna join them in a few years.",
	"Festivals.Dead.Gus": "I know the dead can't actually eat, but I hope they appreciate the food I made!#$b#I tried some new recipes this year. Just because they're dead doesn't mean they don't get bored!",
	"Festivals.Dead.Haley": "It's so creepy to think that there are all these ghosts walking around town all the time... and we can only see them today.",
	"Festivals.Dead.Harvey": "Today I remember all the patients I've lost.#$e#%Harvey stares into the fire.",
	"Festivals.Dead.Jas": "I don't like talking to the ghosts... some of them are really sad. Or really angry.",
	"Festivals.Dead.Jodi": "I hope the kids behave... this is an important day for the whole town.$2",
	"Festivals.Dead.Kent": "Remembering the dead is our responsibility as the ones still living.#$b#Even if it's difficult.",
	"Festivals.Dead.Leah": "I think the Festival of the Beyond is really bittersweet. It's sad to think of everyone we've lost, but honoring them like this makes it more bearable.",
	"Festivals.Dead.Leo": "Do parrots come back as ghosts too?",
	"Festivals.Dead.Lewis":"Hi, @. Glad you could make it!#$b#There's food for the town on this table, but don't eat anything from the other table. That's for our visitors.#$e#If you have something you want to throw into the bonfire as an offering to the dead, go ahead and do that anytime.",
	"Festivals.Dead.Linus": "It's odd to think that I'll be remembered and honored even after I've died and returned my body to nature.",
	"Festivals.Dead.Marlon": "What makes these ghosts different from the ghosts in the mines?#$e#...Are they different from the ghosts down there?",
	"Festivals.Dead.Marnie": "Do you think animals get the choice to stay?#$b#I've never seen a ghostly animal, but maybe they all choose to move on.#$e#Some people say they're smarter than us that way.",
	"Festivals.Dead.Maru": "Ghosts, spirits, it really makes you think, doesn't it? About what else might be possible.",
	"Festivals.Dead.Pam": "%Pam pours her drink into the flames, a sign of respect.",
	"Festivals.Dead.Penny": "Would you stay? If you died, I mean.",
	"Festivals.Dead.Pierre": "I wonder if any of the ghosts are interested in my produce...?#$b#There's always room for growing your customer base!",
	"Festivals.Dead.Robin": "I wonder if the dead are content with what we've built after them.",
	"Festivals.Dead.Sam": "My dad hates this festival. I kind of get why.",
	"Festivals.Dead.Sebastian": "I think it's really cool that we can talk to people after they die. When I die, I'm going to haunt the town forever.",
	"Festivals.Dead.Shane": "This is such a depressing holiday. I can't even enjoy the food.$s",
	"Festivals.Dead.Vincent": "Mom said Jas and I aren't allowed to run around today. We hafta be *respectful*.#$b#Maybe the ghosts want to run around with us, though?",
	"Festivals.Dead.Willy": "I'd always hoped my granddad would stick around so we could talk to him again.#$b#He was lost at sea, so I guess he never found his way home.",
	"Festivals.Dead.Wizard": "With the right spells, one can talk to the dead any day of the year, not only today.#$e#There are other side effects, though...",
	
	"Festivals.Dead.CatKing": "Must be nice to hang around like this after you die. The whole nine lives thing gets old fast.",
	"Festivals.Dead.CharlesRowland": "I forgot what it was like for people to see us!$h#$b#If only we could eat the food they left out. That roasting meat smells so good...",
	"Festivals.Dead.CrystalPalace": "Hopefully we'll be able to help some of these ghosts move on today.#$e#The veil is thin today. I told you fall is a really busy time of year for us!$h",
	"Festivals.Dead.EdwinPayne": "I have become unaccustomed to being visible to the living.#$b#I must say, I do not find myself enjoying it like Charles does.$s",
	"Festivals.Dead.EstherFinch": "It's so *noisy* with all these pesky little ghosts around.#$e#Me? I'm only here to see if I can capture any of them who are stupid enough to fall for a pretty face.#$b#They make such good fuel, after all.",
	"Festivals.Dead.JennyButcher": "Seeing ghosts all the time is exhausting, and today is no different.#$b#At least today there's free food, though.",
	"Festivals.Dead.MontyFinch": "It's really sad that none of these ghosts can move on. What's keeping them here?$s",
	"Festivals.Dead.NikoSasaki": "It's really sweet of everyone to honor the dead like this.#$b#It reminds me of when we celebrated Obon back home!",


	// spirit's eve
	"Festivals.Halloween.CharlesRowland": "It's the busiest night of the year for us. We're here to make sure nothing goes wrong, yeah?$u",
	"Festivals.Halloween.EdwinPayne": "You haven't attracted any curses or wronged any sprits lately, have you, @? I'd be careful on a night such as this one.",
	"Festivals.Halloween.CrystalPalace": "I don't care what Edwin says about keeping an eye on things--you couldn't pay me to go in that creepy-ass maze.#$b#I can't exactly walk through walls.",
	"Festivals.Halloween.NikoSasaki": "Eek! What was that?#$b#Oh, @, it's just you. Sorry, I'm a little jumpy.",
	"Festivals.Halloween.MontyFinch": "This is the one night a year Esther lets me do whatever I want, in the spirit of the season.",
	"Festivals.Halloween.CatKing": "Spirit's Eve is a very powerful night for cats.#$e#You and I could also make it a powerful night, what do you say?",
	"Festivals.Halloween.EstherFinch": "Ah, the smell of scared children. It's like coffee to me. Wakes the senses right up.$u",
	"Festivals.Halloween.JennyButcher": "It's a perfect night to stay at home and watch true crime documentaries, but I promised Crystal I would come to the festival.",

	// festival of ice
	"Festivals.Ice.EdwinPayne": "Charles elected not to attend, and it's little question why. I myself am only here on matters pertaining to a current case.",
	"Festivals.Ice.CrystalPalace": "I'm kind of worried about Charles. He didn't look so good when Edwin and I left.",
	"Festivals.Ice.NikoSasaki": "Brr, it's cold out. I wish I had some tea to warm myself up.",
	"Festivals.Ice.MontyFinch": "Whee! Want to make snow angels with me?",
	"Festivals.Ice.CatKing": "I hate forests. Why are there so many trees? Ugh.$a#$b#I only came to this stupid festival because one of my cats told me Edwin would be here without his little guard dog.",
	"Festivals.Ice.EstherFinch": "They should all be carving statues of me.", // unused

	
	// feast of the winter star
	"Festivals.Christmas.CharlesRowland": "Edwin, Crystal and I already exchanged gifts this morning, but it's so fun seeing everyone else open up their presents.$h",
	"Festivals.Christmas.EdwinPayne": "Winter was always a rare bright spot during my childhood. The Christmas holidays meant a reprieve from St. Hilarion's halls.",
	"Festivals.Christmas.CrystalPalace": "It's so nice actually spending the holidays with people you like.#$b#My mom and dad used to drag me to every fancy party they could.#$e#When I turned thirteen I just started going home on my own as soon as they got drunk.",
	"Festivals.Christmas.NikoSasaki": "I hope I get a new issue of my favorite manga.",
	"Festivals.Christmas.MontyFinch": "Did you get any gifts this morning? What was your favorite?",
	"Festivals.Christmas.CatKing": "The only present I want to find under the tree... is you.$h#$e#Oh come on, it's just a little holiday flirting!$u",
	"Festivals.Christmas.EstherFinch": "All this... festive spirit... Ugh, it's sickening.$a",
	"Festivals.Halloween.JennyButcher": "Hey kid. Did you have a good year?$h",
}