{
	// REGULAR DIALOGUE
	"monty_dialogue.Introduction": "Hi! I'm Monty. I live up in the mountains, but if I'm being honest, I hate it there.#$b#Coming to town is the only way to meet new people. Like you!$h",
	"monty_dialogue.cc_Begin": "You're renovating the Community Center? Man, Edwin and Charles are *not* going to like that.#$b#I won't tell them if you don't want me to, though. I can keep a secret.$h",
	"monty_dialogue.cc_Boulder": "Did something happen to the water supply? I keep getting distracted by all that glittery stuff in the water.",
	"monty_dialogue.cc_Bridge": "That quarry near the house opened up! Now I have another place to explore.$h",
	"monty_dialogue.cc_Bus": "You've never been to Calico Desert, have you?#$b#Well now that the bus is fixed, we should go!#$e#The night sky there is the clearest you'll ever see.$u",
	"monty_dialogue.cc_Greenhouse": "Does this mean you can grow crops year-round?#$b#Man... I hope you're not too busy to talk to me!",
	"monty_dialogue.cc_Minecart": "It must be nice to get around town so quickly with the new minecarts!#$b#Almost as fast as flying, huh?",
	"monty_dialogue.DumpsterDiveComment": "@, I'm gonna be honest, that's disgusting.$a",
	"monty_dialogue.FlowerDance_Accept": "You want to dance with me?$l#$b#Yes!, of course! Let's go make everyone jealous.$h",
	"monty_dialogue.FlowerDance_Decline": "Um, no offense, but I'd much rather dance with someone else.",
	"monty_dialogue.GreenRain": "This is creepy... Do you think Esther is responsible?$s#$b#She does weird things like this sometimes.$s",
	"monty_dialogue.AcceptGift(O)StardropTea": "For me? You didn't have to!$l",
	"monty_dialogue.Mon": "Do you ever wish you could just get lost and not come back?",
	"monty_dialogue.Tue": "Hi, @! Want to hear the weekly horoscope?#$e#'You {{horoscopeVerb}} {{horoscopeNoun}}. Look {{horoscopePlace}}'.#$b#What do you think it means?$u",
	"monty_dialogue.Wed": "Have you been down to the docks off the beach? All those cats lurking around give me the creeps.$s",
	"monty_dialogue.Thu": "It's such a beautiful day out. I feel like I could get lost in nature forever.",
	"monty_dialogue.Fri": "Hardworking, friendly, outgoing... you must be a Taurus, am I right?",
	"monty_dialogue.Sat": "Hi @! Read any good books lately?$h",
	"monty_dialogue.Sun": "I ran into that Cat King yesterday. Ugh, he's so... ugh!$a",
	"monty_dialogue.Mon4": "You've been hanging out at the agency, huh?#$b#Do you think you could tell me about it? I've never been.",
	"monty_dialogue.Wed4": "Pisces are supposed to be compatible with Capricorns romantically... or are Leos more compatible?",
	"monty_dialogue.Thu4": "The stars were beautiful last night. Did you get a chance to see them?$u",
	"monty_dialogue.Fri4": "Have you been having any trouble with crows on your farm? I could try and help.#$e#I, uh, read about their behavior in a book.",
	"monty_dialogue.Sat4": "Hmm... do you know when Crystal's birthday is? I'm trying to calculate her birth chart, but it's not making sense.",
	"monty_dialogue.Sun4": "Have you met the wizard?#$b#I've been avoiding him. Witches and wizards don't always get along...",
	"monty_dialogue.Mon6": "I've got to get to the library. My hold on The Doll House just ended.",
	"monty_dialogue.Wed6": "Ugh, Esther is working on some sort of youth potion that stinks up the entire house.",
	"monty_dialogue.Thu6": "Have you ever been to the top of Point No Point Lighthouse? The view is amazing.$u",
	"monty_dialogue.Fri6": "I was reading this book about dwarves, and it mentioned that they live underground.#$e#Ugh, I could never.",
	"monty_dialogue.Sat6": "Did you always think you were going to be a farmer when you grew up?#$b#I don't know what I want to do... is that normal?",
	"monty_dialogue.Sun6": "It's kind of refreshing living somewhere like Pelican Town.#$b#Where we used to live, I couldn't tell anyone about anything supernatural.",
	"monty_dialogue.Mon8": "Have you talked to Edwin lately?#$e#...Do you think he'd want to see me?$s",
	"monty_dialogue.Wed8": "I think I'd like to travel... if I could, I mean.#$b#But Pelican Town is cute enough!",
	"monty_dialogue.Thu8": "We should take a trip to the desert sometime. The night sky is supposed to look amazing out there.",
	"monty_dialogue.Fri8": "If you have any extra produce this season, keep me in mind! I love fresh fruits and vegetables.$h",
	"monty_dialogue.Sat8": "I was studying the stars last night and they said that you and I should hang out today.$h",
	"monty_dialogue.Sun8": "I heard Crystal is taking classes online. Maybe I should enroll too...#$b#I never went to school. I learned everything I know from Esther and the books I check out at the library.",
	
	"monty_dialogue.Mon10": "I was looking for constellations last night and saw a shooting star. Pretty cool, huh?#$q MontyWishFallback#What would you wish for?
        #$r {{ModId}}_MontyWish1 0 MontyWishReaction1#More money.
        #$r {{ModId}}_MontyWish2 0 MontyWishReaction2#More time.
        #$r {{ModId}}_MontyWish3 0 MontyWishReaction3#More friends.
        #$r {{ModId}}_MontyWish4 0 MontyWishReaction4#I'm happy without making wishes
	",
	"monty_dialogue.MontyWishReaction1": "Kind of unoriginal, but okay. I wish money would solve all my problems...",
	"monty_dialogue.MontyWishReaction2": "Eugh, you sound like Esther...$7#$b#Sorry, I know you don't mean it like that, but you wouldn't believe the things she's done to stay young forever...$s",
	"monty_dialogue.MontyWishReaction3": "Aww, but you're so popular!#$b#Well, I'm your friend, no matter what.$l",
	"monty_dialogue.MontyWishReaction4": "Wow, that's so deep...$u",
	"monty_dialogue.MontyWishFollowup": "What's that saying? If wishes were fishes?",
	
	"monty_dialogue.Wed10": "Hey, are you free tomorrow? You should come over to my new place! Edwin, Niko and I are thinking about starting a book club.",
	"monty_dialogue.Thu10": "We should take a trip to the desert sometime. The night sky is supposed to look amazing out there.",
	"monty_dialogue.Fri10": "Jenny said she might hire me to work at the butcher shop. It would be nice to have a job.",
	"monty_dialogue.Sat10": "I was studying the stars last night and they said that you and I should hang out today.$h",
	"monty_dialogue.Sun10": "I heard Crystal is taking classes online. Maybe I should enroll too...#$b#I never went to school. I learned everything I know from Esther and the books I check out at the library.",
	"monty_dialogue.spring_1": "Another year gone! What do you think the stars have in store for this one?",
	"monty_dialogue.fall_26": "I can't wait for tomorrow's festival. Esther is usually busy with weird witchy stuff, so I can do whatever I want.",
	
	// GIFT TASTES
	"MontyFinch.love": "Wow, @, this is incredible!$u",
	"MontyFinch.like": "This is pretty neat. Where'd you get it?$h",
	"MontyFinch.dislike": "You want me to have it? Sure, whatever.$a",
	"MontyFinch.hate": "Wow, it's actually incredible how much I hate this.$a",
	"MontyFinch.neutral": "Sure, thanks.",
}